xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

aventen_s3_sync.name=Aventen S3 Sync
aventen_s3_sync.vid.0=0x303a
aventen_s3_sync.pid.0=0x1001
## Based upon ESP32-S3 Dev Board

aventen_s3_sync.bootloader.tool=esptool_py
aventen_s3_sync.bootloader.tool.default=esptool_py

aventen_s3_sync.upload.tool=esptool_py
aventen_s3_sync.upload.tool.default=esptool_py
aventen_s3_sync.upload.tool.network=esp_ota

aventen_s3_sync.upload.maximum_size=1310720
aventen_s3_sync.upload.maximum_data_size=327680
aventen_s3_sync.upload.flags=
aventen_s3_sync.upload.extra_flags=
aventen_s3_sync.upload.use_1200bps_touch=false
aventen_s3_sync.upload.wait_for_upload_port=false

aventen_s3_sync.serial.disableDTR=false
aventen_s3_sync.serial.disableRTS=false

aventen_s3_sync.build.tarch=xtensa
aventen_s3_sync.build.bootloader_addr=0x0
aventen_s3_sync.build.target=esp32s3
aventen_s3_sync.build.mcu=esp32s3
aventen_s3_sync.build.core=esp32
aventen_s3_sync.build.variant=Aventen_S3_Sync
aventen_s3_sync.build.board=AVENTEN_S3_SYNC

aventen_s3_sync.build.usb_mode=1
aventen_s3_sync.build.cdc_on_boot=0
aventen_s3_sync.build.msc_on_boot=0
aventen_s3_sync.build.dfu_on_boot=0
aventen_s3_sync.build.f_cpu=240000000L
aventen_s3_sync.build.flash_size=16MB
aventen_s3_sync.build.flash_freq=80m
aventen_s3_sync.build.flash_mode=dio
aventen_s3_sync.build.boot=qio
aventen_s3_sync.build.boot_freq=80m
aventen_s3_sync.build.partitions=default
aventen_s3_sync.build.defines=
aventen_s3_sync.build.loop_core=
aventen_s3_sync.build.event_core=
aventen_s3_sync.build.psram_type=qspi
aventen_s3_sync.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0
aventen_s3_sync.menu.JTAGAdapter.default=Disabled
aventen_s3_sync.menu.JTAGAdapter.default.build.copy_jtag_files=0
aventen_s3_sync.menu.JTAGAdapter.builtin=Integrated USB JTAG
aventen_s3_sync.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
aventen_s3_sync.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
aventen_s3_sync.menu.JTAGAdapter.external=FTDI Adapter
aventen_s3_sync.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
aventen_s3_sync.menu.JTAGAdapter.external.build.copy_jtag_files=1
aventen_s3_sync.menu.JTAGAdapter.bridge=ESP USB Bridge
aventen_s3_sync.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
aventen_s3_sync.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

aventen_s3_sync.menu.PSRAM.disabled=Disabled
aventen_s3_sync.menu.PSRAM.disabled.build.defines=
aventen_s3_sync.menu.PSRAM.disabled.build.psram_type=qspi
aventen_s3_sync.menu.PSRAM.enabled=QSPI PSRAM
aventen_s3_sync.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
aventen_s3_sync.menu.PSRAM.enabled.build.psram_type=qspi
aventen_s3_sync.menu.PSRAM.opi=OPI PSRAM
aventen_s3_sync.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
aventen_s3_sync.menu.PSRAM.opi.build.psram_type=opi

aventen_s3_sync.menu.FlashMode.qio=QIO 80MHz
aventen_s3_sync.menu.FlashMode.qio.build.flash_mode=dio
aventen_s3_sync.menu.FlashMode.qio.build.boot=qio
aventen_s3_sync.menu.FlashMode.qio.build.boot_freq=80m
aventen_s3_sync.menu.FlashMode.qio.build.flash_freq=80m
aventen_s3_sync.menu.FlashMode.qio120=QIO 120MHz
aventen_s3_sync.menu.FlashMode.qio120.build.flash_mode=dio
aventen_s3_sync.menu.FlashMode.qio120.build.boot=qio
aventen_s3_sync.menu.FlashMode.qio120.build.boot_freq=120m
aventen_s3_sync.menu.FlashMode.qio120.build.flash_freq=80m
aventen_s3_sync.menu.FlashMode.dio=DIO 80MHz
aventen_s3_sync.menu.FlashMode.dio.build.flash_mode=dio
aventen_s3_sync.menu.FlashMode.dio.build.boot=dio
aventen_s3_sync.menu.FlashMode.dio.build.boot_freq=80m
aventen_s3_sync.menu.FlashMode.dio.build.flash_freq=80m
aventen_s3_sync.menu.FlashMode.opi=OPI 80MHz
aventen_s3_sync.menu.FlashMode.opi.build.flash_mode=dout
aventen_s3_sync.menu.FlashMode.opi.build.boot=opi
aventen_s3_sync.menu.FlashMode.opi.build.boot_freq=80m
aventen_s3_sync.menu.FlashMode.opi.build.flash_freq=80m

aventen_s3_sync.menu.FlashSize.16M=16MB (128Mb)
aventen_s3_sync.menu.FlashSize.16M.build.flash_size=16MB

aventen_s3_sync.menu.LoopCore.1=Core 1
aventen_s3_sync.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
aventen_s3_sync.menu.LoopCore.0=Core 0
aventen_s3_sync.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

aventen_s3_sync.menu.EventsCore.1=Core 1
aventen_s3_sync.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
aventen_s3_sync.menu.EventsCore.0=Core 0
aventen_s3_sync.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

aventen_s3_sync.menu.USBMode.hwcdc=Hardware CDC and JTAG
aventen_s3_sync.menu.USBMode.hwcdc.build.usb_mode=1
aventen_s3_sync.menu.USBMode.default=USB-OTG (TinyUSB)
aventen_s3_sync.menu.USBMode.default.build.usb_mode=0

aventen_s3_sync.menu.CDCOnBoot.default=Disabled
aventen_s3_sync.menu.CDCOnBoot.default.build.cdc_on_boot=0
aventen_s3_sync.menu.CDCOnBoot.cdc=Enabled
aventen_s3_sync.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

aventen_s3_sync.menu.MSCOnBoot.default=Disabled
aventen_s3_sync.menu.MSCOnBoot.default.build.msc_on_boot=0
aventen_s3_sync.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
aventen_s3_sync.menu.MSCOnBoot.msc.build.msc_on_boot=1

aventen_s3_sync.menu.DFUOnBoot.default=Disabled
aventen_s3_sync.menu.DFUOnBoot.default.build.dfu_on_boot=0
aventen_s3_sync.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
aventen_s3_sync.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

aventen_s3_sync.menu.UploadMode.default=UART0 / Hardware CDC
aventen_s3_sync.menu.UploadMode.default.upload.use_1200bps_touch=false
aventen_s3_sync.menu.UploadMode.default.upload.wait_for_upload_port=false
aventen_s3_sync.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
aventen_s3_sync.menu.UploadMode.cdc.upload.use_1200bps_touch=true
aventen_s3_sync.menu.UploadMode.cdc.upload.wait_for_upload_port=true

aventen_s3_sync.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.default.build.partitions=default
aventen_s3_sync.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
aventen_s3_sync.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
aventen_s3_sync.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
aventen_s3_sync.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
aventen_s3_sync.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.minimal.build.partitions=minimal
aventen_s3_sync.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.no_ota.build.partitions=no_ota
aventen_s3_sync.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
aventen_s3_sync.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
aventen_s3_sync.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
aventen_s3_sync.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
aventen_s3_sync.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
aventen_s3_sync.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
aventen_s3_sync.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
aventen_s3_sync.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
aventen_s3_sync.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
aventen_s3_sync.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.huge_app.build.partitions=huge_app
aventen_s3_sync.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
aventen_s3_sync.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
aventen_s3_sync.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
aventen_s3_sync.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
aventen_s3_sync.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
aventen_s3_sync.menu.PartitionScheme.fatflash.build.partitions=ffat
aventen_s3_sync.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
aventen_s3_sync.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
aventen_s3_sync.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
aventen_s3_sync.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
aventen_s3_sync.menu.PartitionScheme.rainmaker=RainMaker
aventen_s3_sync.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
aventen_s3_sync.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

aventen_s3_sync.menu.CPUFreq.240=240MHz (WiFi)
aventen_s3_sync.menu.CPUFreq.240.build.f_cpu=240000000L
aventen_s3_sync.menu.CPUFreq.160=160MHz (WiFi)
aventen_s3_sync.menu.CPUFreq.160.build.f_cpu=160000000L
aventen_s3_sync.menu.CPUFreq.80=80MHz (WiFi)
aventen_s3_sync.menu.CPUFreq.80.build.f_cpu=80000000L
aventen_s3_sync.menu.CPUFreq.40=40MHz
aventen_s3_sync.menu.CPUFreq.40.build.f_cpu=40000000L
aventen_s3_sync.menu.CPUFreq.20=20MHz
aventen_s3_sync.menu.CPUFreq.20.build.f_cpu=20000000L
aventen_s3_sync.menu.CPUFreq.10=10MHz
aventen_s3_sync.menu.CPUFreq.10.build.f_cpu=10000000L

aventen_s3_sync.menu.UploadSpeed.921600=921600
aventen_s3_sync.menu.UploadSpeed.921600.upload.speed=921600
aventen_s3_sync.menu.UploadSpeed.115200=115200
aventen_s3_sync.menu.UploadSpeed.115200.upload.speed=115200
aventen_s3_sync.menu.UploadSpeed.256000.windows=256000
aventen_s3_sync.menu.UploadSpeed.256000.upload.speed=256000
aventen_s3_sync.menu.UploadSpeed.230400.windows.upload.speed=256000
aventen_s3_sync.menu.UploadSpeed.230400=230400
aventen_s3_sync.menu.UploadSpeed.230400.upload.speed=230400
aventen_s3_sync.menu.UploadSpeed.460800.linux=460800
aventen_s3_sync.menu.UploadSpeed.460800.macosx=460800
aventen_s3_sync.menu.UploadSpeed.460800.upload.speed=460800
aventen_s3_sync.menu.UploadSpeed.512000.windows=512000
aventen_s3_sync.menu.UploadSpeed.512000.upload.speed=512000

aventen_s3_sync.menu.DebugLevel.none=None
aventen_s3_sync.menu.DebugLevel.none.build.code_debug=0
aventen_s3_sync.menu.DebugLevel.error=Error
aventen_s3_sync.menu.DebugLevel.error.build.code_debug=1
aventen_s3_sync.menu.DebugLevel.warn=Warn
aventen_s3_sync.menu.DebugLevel.warn.build.code_debug=2
aventen_s3_sync.menu.DebugLevel.info=Info
aventen_s3_sync.menu.DebugLevel.info.build.code_debug=3
aventen_s3_sync.menu.DebugLevel.debug=Debug
aventen_s3_sync.menu.DebugLevel.debug.build.code_debug=4
aventen_s3_sync.menu.DebugLevel.verbose=Verbose
aventen_s3_sync.menu.DebugLevel.verbose.build.code_debug=5

aventen_s3_sync.menu.EraseFlash.none=Disabled
aventen_s3_sync.menu.EraseFlash.none.upload.erase_cmd=
aventen_s3_sync.menu.EraseFlash.all=Enabled
aventen_s3_sync.menu.EraseFlash.all.upload.erase_cmd=-e

