xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
feathers3.menu.USBMode.default=USB-OTG (TinyUSB)
feathers3.menu.USBMode.default.build.usb_mode=0
feathers3.menu.USBMode.hwcdc=Hardware CDC and JTAG
feathers3.menu.USBMode.hwcdc.build.usb_mode=1

feathers3.menu.CDCOnBoot.cdc=Enabled
feathers3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
feathers3.menu.CDCOnBoot.default=Disabled
feathers3.menu.CDCOnBoot.default.build.cdc_on_boot=0

feathers3.menu.MSCOnBoot.default=Disabled
feathers3.menu.MSCOnBoot.default.build.msc_on_boot=0
feathers3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
feathers3.menu.MSCOnBoot.msc.build.msc_on_boot=1

feathers3.menu.DFUOnBoot.default=Disabled
feathers3.menu.DFUOnBoot.default.build.dfu_on_boot=0
feathers3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
feathers3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

feathers3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
feathers3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
feathers3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
feathers3.menu.UploadMode.default=UART0 / Hardware CDC
feathers3.menu.UploadMode.default.upload.use_1200bps_touch=false
feathers3.menu.UploadMode.default.upload.wait_for_upload_port=false

feathers3.menu.PSRAM.enabled=Enabled
feathers3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
feathers3.menu.PSRAM.disabled=Disabled
feathers3.menu.PSRAM.disabled.build.defines=

feathers3.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
feathers3.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
feathers3.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
feathers3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/12MB FFAT)
feathers3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
feathers3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
feathers3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
feathers3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
feathers3.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
feathers3.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
feathers3.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
feathers3.menu.PartitionScheme.app3M_fat9M_16MB=FFAT (3MB APP/9MB FATFS)
feathers3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
feathers3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
feathers3.menu.PartitionScheme.fatflash=Large FFAT (2MB APP/12.5MB FATFS)
feathers3.menu.PartitionScheme.fatflash.build.partitions=ffat
feathers3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

feathers3.menu.CPUFreq.240=240MHz (WiFi)
feathers3.menu.CPUFreq.240.build.f_cpu=240000000L
feathers3.menu.CPUFreq.160=160MHz (WiFi)
feathers3.menu.CPUFreq.160.build.f_cpu=160000000L
feathers3.menu.CPUFreq.80=80MHz (WiFi)
feathers3.menu.CPUFreq.80.build.f_cpu=80000000L
feathers3.menu.CPUFreq.40=40MHz
feathers3.menu.CPUFreq.40.build.f_cpu=40000000L
feathers3.menu.CPUFreq.20=20MHz
feathers3.menu.CPUFreq.20.build.f_cpu=20000000L
feathers3.menu.CPUFreq.10=10MHz
feathers3.menu.CPUFreq.10.build.f_cpu=10000000L

feathers3.menu.FlashMode.qio=QIO
feathers3.menu.FlashMode.qio.build.flash_mode=dio
feathers3.menu.FlashMode.qio.build.boot=qio
feathers3.menu.FlashMode.dio=DIO
feathers3.menu.FlashMode.dio.build.flash_mode=dio
feathers3.menu.FlashMode.dio.build.boot=dio

feathers3.menu.UploadSpeed.921600=921600
feathers3.menu.UploadSpeed.921600.upload.speed=921600
feathers3.menu.UploadSpeed.115200=115200
feathers3.menu.UploadSpeed.115200.upload.speed=115200
feathers3.menu.UploadSpeed.256000.windows=256000
feathers3.menu.UploadSpeed.256000.upload.speed=256000
feathers3.menu.UploadSpeed.230400.windows.upload.speed=256000
feathers3.menu.UploadSpeed.230400=230400
feathers3.menu.UploadSpeed.230400.upload.speed=230400
feathers3.menu.UploadSpeed.460800.linux=460800
feathers3.menu.UploadSpeed.460800.macosx=460800
feathers3.menu.UploadSpeed.460800.upload.speed=460800
feathers3.menu.UploadSpeed.512000.windows=512000
feathers3.menu.UploadSpeed.512000.upload.speed=512000

feathers3.menu.DebugLevel.none=None
feathers3.menu.DebugLevel.none.build.code_debug=0
feathers3.menu.DebugLevel.error=Error
feathers3.menu.DebugLevel.error.build.code_debug=1
feathers3.menu.DebugLevel.warn=Warn
feathers3.menu.DebugLevel.warn.build.code_debug=2
feathers3.menu.DebugLevel.info=Info
feathers3.menu.DebugLevel.info.build.code_debug=3
feathers3.menu.DebugLevel.debug=Debug
feathers3.menu.DebugLevel.debug.build.code_debug=4
feathers3.menu.DebugLevel.verbose=Verbose
feathers3.menu.DebugLevel.verbose.build.code_debug=5

feathers3.menu.EraseFlash.none=Disabled
feathers3.menu.EraseFlash.none.upload.erase_cmd=
feathers3.menu.EraseFlash.all=Enabled
feathers3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

S_ODI_Ultra.name=S.ODI Ultra v1

S_ODI_Ultra.bootloader.tool=esptool_py
S_ODI_Ultra.bootloader.tool.default=esptool_py

S_ODI_Ultra.upload.tool=esptool_py
S_ODI_Ultra.upload.tool.default=esptool_py
S_ODI_Ultra.upload.tool.network=esp_ota

S_ODI_Ultra.upload.maximum_size=1310720
S_ODI_Ultra.upload.maximum_data_size=327680
S_ODI_Ultra.upload.wait_for_upload_port=true
S_ODI_Ultra.upload.flags=
S_ODI_Ultra.upload.extra_flags=

S_ODI_Ultra.serial.disableDTR=true
S_ODI_Ultra.serial.disableRTS=true

S_ODI_Ultra.build.tarch=xtensa
S_ODI_Ultra.build.bootloader_addr=0x1000
S_ODI_Ultra.build.target=esp32
S_ODI_Ultra.build.mcu=esp32
S_ODI_Ultra.build.core=esp32
S_ODI_Ultra.build.variant=S_ODI_Ultra_v1
S_ODI_Ultra.build.board=ESP32_DEV

S_ODI_Ultra.build.f_cpu=240000000L
S_ODI_Ultra.build.flash_mode=dio
S_ODI_Ultra.build.flash_size=4MB
S_ODI_Ultra.build.boot=dio
S_ODI_Ultra.build.partitions=default
S_ODI_Ultra.build.defines=

S_ODI_Ultra.menu.FlashFreq.80=80MHz
S_ODI_Ultra.menu.FlashFreq.80.build.flash_freq=80m
S_ODI_Ultra.menu.FlashFreq.40=40MHz
S_ODI_Ultra.menu.FlashFreq.40.build.flash_freq=40m

