xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

sparkfun_lora_gateway_1-channel.name=SparkFun LoRa Gateway 1-Channel

sparkfun_lora_gateway_1-channel.bootloader.tool=esptool_py
sparkfun_lora_gateway_1-channel.bootloader.tool.default=esptool_py

sparkfun_lora_gateway_1-channel.upload.tool=esptool_py
sparkfun_lora_gateway_1-channel.upload.tool.default=esptool_py
sparkfun_lora_gateway_1-channel.upload.tool.network=esp_ota

sparkfun_lora_gateway_1-channel.upload.maximum_size=1310720
sparkfun_lora_gateway_1-channel.upload.maximum_data_size=294912
sparkfun_lora_gateway_1-channel.upload.flags=
sparkfun_lora_gateway_1-channel.upload.extra_flags=

sparkfun_lora_gateway_1-channel.serial.disableDTR=true
sparkfun_lora_gateway_1-channel.serial.disableRTS=true

sparkfun_lora_gateway_1-channel.build.tarch=xtensa
sparkfun_lora_gateway_1-channel.build.bootloader_addr=0x1000
sparkfun_lora_gateway_1-channel.build.target=esp32
sparkfun_lora_gateway_1-channel.build.mcu=esp32
sparkfun_lora_gateway_1-channel.build.core=esp32
sparkfun_lora_gateway_1-channel.build.variant=sparkfun_lora_gateway_1-channel
sparkfun_lora_gateway_1-channel.build.board=ESP32_DEV

sparkfun_lora_gateway_1-channel.build.f_cpu=240000000L
sparkfun_lora_gateway_1-channel.build.flash_size=4MB
sparkfun_lora_gateway_1-channel.build.flash_freq=40m
sparkfun_lora_gateway_1-channel.build.flash_mode=dio
sparkfun_lora_gateway_1-channel.build.boot=dio
sparkfun_lora_gateway_1-channel.build.partitions=default

sparkfun_lora_gateway_1-channel.menu.PartitionScheme.default=Default
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.default.build.partitions=default
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.minimal.build.partitions=minimal
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.no_ota=No OTA (Large APP)
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.no_ota.build.partitions=no_ota
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
sparkfun_lora_gateway_1-channel.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

sparkfun_lora_gateway_1-channel.menu.FlashMode.qio=QIO
sparkfun_lora_gateway_1-channel.menu.FlashMode.qio.build.flash_mode=dio
sparkfun_lora_gateway_1-channel.menu.FlashMode.qio.build.boot=qio
sparkfun_lora_gateway_1-channel.menu.FlashMode.dio=DIO
sparkfun_lora_gateway_1-channel.menu.FlashMode.dio.build.flash_mode=dio
sparkfun_lora_gateway_1-channel.menu.FlashMode.dio.build.boot=dio
sparkfun_lora_gateway_1-channel.menu.FlashMode.qout=QOUT
sparkfun_lora_gateway_1-channel.menu.FlashMode.qout.build.flash_mode=dout
sparkfun_lora_gateway_1-channel.menu.FlashMode.qout.build.boot=qout
sparkfun_lora_gateway_1-channel.menu.FlashMode.dout=DOUT
sparkfun_lora_gateway_1-channel.menu.FlashMode.dout.build.flash_mode=dout
sparkfun_lora_gateway_1-channel.menu.FlashMode.dout.build.boot=dout

sparkfun_lora_gateway_1-channel.menu.FlashFreq.80=80MHz
sparkfun_lora_gateway_1-channel.menu.FlashFreq.80.build.flash_freq=80m
sparkfun_lora_gateway_1-channel.menu.FlashFreq.40=40MHz
sparkfun_lora_gateway_1-channel.menu.FlashFreq.40.build.flash_freq=40m

sparkfun_lora_gateway_1-channel.menu.FlashSize.4M=4MB (32Mb)
sparkfun_lora_gateway_1-channel.menu.FlashSize.4M.build.flash_size=4MB

sparkfun_lora_gateway_1-channel.menu.UploadSpeed.921600=921600
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.921600.upload.speed=921600
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.115200=115200
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.115200.upload.speed=115200
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.256000.windows=256000
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.256000.upload.speed=256000
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.230400.windows.upload.speed=256000
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.230400=230400
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.230400.upload.speed=230400
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.460800.linux=460800
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.460800.macosx=460800
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.460800.upload.speed=460800
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.512000.windows=512000
sparkfun_lora_gateway_1-channel.menu.UploadSpeed.512000.upload.speed=512000

sparkfun_lora_gateway_1-channel.menu.DebugLevel.none=None
sparkfun_lora_gateway_1-channel.menu.DebugLevel.none.build.code_debug=0
sparkfun_lora_gateway_1-channel.menu.DebugLevel.error=Error
sparkfun_lora_gateway_1-channel.menu.DebugLevel.error.build.code_debug=1
sparkfun_lora_gateway_1-channel.menu.DebugLevel.warn=Warn
sparkfun_lora_gateway_1-channel.menu.DebugLevel.warn.build.code_debug=2
sparkfun_lora_gateway_1-channel.menu.DebugLevel.info=Info
sparkfun_lora_gateway_1-channel.menu.DebugLevel.info.build.code_debug=3
sparkfun_lora_gateway_1-channel.menu.DebugLevel.debug=Debug
sparkfun_lora_gateway_1-channel.menu.DebugLevel.debug.build.code_debug=4
sparkfun_lora_gateway_1-channel.menu.DebugLevel.verbose=Verbose
sparkfun_lora_gateway_1-channel.menu.DebugLevel.verbose.build.code_debug=5

sparkfun_lora_gateway_1-channel.menu.EraseFlash.none=Disabled
sparkfun_lora_gateway_1-channel.menu.EraseFlash.none.upload.erase_cmd=
sparkfun_lora_gateway_1-channel.menu.EraseFlash.all=Enabled
sparkfun_lora_gateway_1-channel.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

sparkfun_esp32_iot_redboard.name=SparkFun ESP32 IoT RedBoard

sparkfun_esp32_iot_redboard.bootloader.tool=esptool_py
sparkfun_esp32_iot_redboard.bootloader.tool.default=esptool_py

sparkfun_esp32_iot_redboard.upload.tool=esptool_py
sparkfun_esp32_iot_redboard.upload.tool.default=esptool_py
sparkfun_esp32_iot_redboard.upload.tool.network=esp_ota

sparkfun_esp32_iot_redboard.upload.maximum_size=1310720
sparkfun_esp32_iot_redboard.upload.maximum_data_size=327680
sparkfun_esp32_iot_redboard.upload.flags=
sparkfun_esp32_iot_redboard.upload.extra_flags=

sparkfun_esp32_iot_redboard.serial.disableDTR=true
sparkfun_esp32_iot_redboard.serial.disableRTS=true

sparkfun_esp32_iot_redboard.build.tarch=xtensa
sparkfun_esp32_iot_redboard.build.bootloader_addr=0x1000
sparkfun_esp32_iot_redboard.build.target=esp32
sparkfun_esp32_iot_redboard.build.mcu=esp32
sparkfun_esp32_iot_redboard.build.core=esp32
sparkfun_esp32_iot_redboard.build.variant=sparkfun_esp32_iot_redboard
sparkfun_esp32_iot_redboard.build.board=ESP32_IOT_REDBOARD

sparkfun_esp32_iot_redboard.build.f_cpu=240000000L
sparkfun_esp32_iot_redboard.build.flash_size=4MB
sparkfun_esp32_iot_redboard.build.flash_freq=40m
sparkfun_esp32_iot_redboard.build.flash_mode=dio
sparkfun_esp32_iot_redboard.build.boot=dio
sparkfun_esp32_iot_redboard.build.partitions=default
sparkfun_esp32_iot_redboard.build.defines=
sparkfun_esp32_iot_redboard.build.loop_core=
sparkfun_esp32_iot_redboard.build.event_core=

sparkfun_esp32_iot_redboard.menu.PSRAM.disabled=Disabled
sparkfun_esp32_iot_redboard.menu.PSRAM.disabled.build.defines=
sparkfun_esp32_iot_redboard.menu.PSRAM.disabled.build.extra_libs=
sparkfun_esp32_iot_redboard.menu.PSRAM.enabled=Enabled
sparkfun_esp32_iot_redboard.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
sparkfun_esp32_iot_redboard.menu.PSRAM.enabled.build.extra_libs=

