xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
lolin32.menu.EraseFlash.none=Disabled
lolin32.menu.EraseFlash.none.upload.erase_cmd=
lolin32.menu.EraseFlash.all=Enabled
lolin32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin32-lite.name=WEMOS LOLIN32 Lite

lolin32-lite.bootloader.tool=esptool_py
lolin32-lite.bootloader.tool.default=esptool_py

lolin32-lite.upload.tool=esptool_py
lolin32-lite.upload.tool.default=esptool_py
lolin32-lite.upload.tool.network=esp_ota

lolin32-lite.upload.maximum_size=1310720
lolin32-lite.upload.maximum_data_size=327680
lolin32-lite.upload.wait_for_upload_port=true
lolin32-lite.upload.flags=
lolin32-lite.upload.extra_flags=

lolin32-lite.serial.disableDTR=true
lolin32-lite.serial.disableRTS=true

lolin32-lite.build.tarch=xtensa
lolin32-lite.build.bootloader_addr=0x1000
lolin32-lite.build.target=esp32
lolin32-lite.build.mcu=esp32
lolin32-lite.build.core=esp32
lolin32-lite.build.variant=lolin32-lite
lolin32-lite.build.board=LOLIN32_LITE

lolin32-lite.build.f_cpu=240000000L
lolin32-lite.build.flash_mode=dio
lolin32-lite.build.flash_size=4MB
lolin32-lite.build.boot=dio
lolin32-lite.build.partitions=default
lolin32-lite.build.defines=

lolin32-lite.menu.FlashFreq.80=80MHz
lolin32-lite.menu.FlashFreq.80.build.flash_freq=80m
lolin32-lite.menu.FlashFreq.40=40MHz
lolin32-lite.menu.FlashFreq.40.build.flash_freq=40m

lolin32-lite.menu.PartitionScheme.default=Default
lolin32-lite.menu.PartitionScheme.default.build.partitions=default
lolin32-lite.menu.PartitionScheme.no_ota=No OTA (Large APP)
lolin32-lite.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin32-lite.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin32-lite.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
lolin32-lite.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lolin32-lite.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

lolin32-lite.menu.CPUFreq.240=240MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.240.build.f_cpu=240000000L
lolin32-lite.menu.CPUFreq.160=160MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.160.build.f_cpu=160000000L
lolin32-lite.menu.CPUFreq.80=80MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.80.build.f_cpu=80000000L
lolin32-lite.menu.CPUFreq.40=40MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.40.build.f_cpu=40000000L
lolin32-lite.menu.CPUFreq.26=26MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.26.build.f_cpu=26000000L
lolin32-lite.menu.CPUFreq.20=20MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.20.build.f_cpu=20000000L
lolin32-lite.menu.CPUFreq.13=13MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.13.build.f_cpu=13000000L
lolin32-lite.menu.CPUFreq.10=10MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.10.build.f_cpu=10000000L

lolin32-lite.menu.UploadSpeed.921600=921600
lolin32-lite.menu.UploadSpeed.921600.upload.speed=921600
lolin32-lite.menu.UploadSpeed.115200=115200
lolin32-lite.menu.UploadSpeed.115200.upload.speed=115200
lolin32-lite.menu.UploadSpeed.256000.windows=256000
lolin32-lite.menu.UploadSpeed.256000.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400=230400
lolin32-lite.menu.UploadSpeed.230400.upload.speed=230400
lolin32-lite.menu.UploadSpeed.460800.linux=460800
lolin32-lite.menu.UploadSpeed.460800.macosx=460800
lolin32-lite.menu.UploadSpeed.460800.upload.speed=460800
lolin32-lite.menu.UploadSpeed.512000.windows=512000
lolin32-lite.menu.UploadSpeed.512000.upload.speed=512000

lolin32-lite.menu.DebugLevel.none=None
lolin32-lite.menu.DebugLevel.none.build.code_debug=0
lolin32-lite.menu.DebugLevel.error=Error
lolin32-lite.menu.DebugLevel.error.build.code_debug=1
lolin32-lite.menu.DebugLevel.warn=Warn
lolin32-lite.menu.DebugLevel.warn.build.code_debug=2
lolin32-lite.menu.DebugLevel.info=Info
lolin32-lite.menu.DebugLevel.info.build.code_debug=3
lolin32-lite.menu.DebugLevel.debug=Debug
lolin32-lite.menu.DebugLevel.debug.build.code_debug=4
lolin32-lite.menu.DebugLevel.verbose=Verbose
lolin32-lite.menu.DebugLevel.verbose.build.code_debug=5

lolin32-lite.menu.EraseFlash.none=Disabled
lolin32-lite.menu.EraseFlash.none.upload.erase_cmd=
lolin32-lite.menu.EraseFlash.all=Enabled
lolin32-lite.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pocket_32.name=Dongsen Tech Pocket 32

pocket_32.bootloader.tool=esptool_py
pocket_32.bootloader.tool.default=esptool_py

pocket_32.upload.tool=esptool_py
pocket_32.upload.tool.default=esptool_py
pocket_32.upload.tool.network=esp_ota

pocket_32.upload.maximum_size=1310720
pocket_32.upload.maximum_data_size=327680
pocket_32.upload.flags=
pocket_32.upload.extra_flags=

pocket_32.serial.disableDTR=true
pocket_32.serial.disableRTS=true

pocket_32.build.tarch=xtensa
pocket_32.build.bootloader_addr=0x1000
pocket_32.build.target=esp32
pocket_32.build.mcu=esp32
pocket_32.build.core=esp32
pocket_32.build.variant=pocket_32
pocket_32.build.board=Pocket32

pocket_32.build.f_cpu=240000000L
pocket_32.build.flash_mode=dio
pocket_32.build.flash_size=4MB
pocket_32.build.boot=dio
pocket_32.build.partitions=default
pocket_32.build.defines=

pocket_32.menu.FlashFreq.80=80MHz
pocket_32.menu.FlashFreq.80.build.flash_freq=80m
pocket_32.menu.FlashFreq.40=40MHz
pocket_32.menu.FlashFreq.40.build.flash_freq=40m

pocket_32.menu.UploadSpeed.921600=921600
pocket_32.menu.UploadSpeed.921600.upload.speed=921600
pocket_32.menu.UploadSpeed.115200=115200
pocket_32.menu.UploadSpeed.115200.upload.speed=115200
pocket_32.menu.UploadSpeed.256000.windows=256000
pocket_32.menu.UploadSpeed.256000.upload.speed=256000
pocket_32.menu.UploadSpeed.230400.windows.upload.speed=256000
pocket_32.menu.UploadSpeed.230400=230400
pocket_32.menu.UploadSpeed.230400.upload.speed=230400
pocket_32.menu.UploadSpeed.460800.linux=460800
pocket_32.menu.UploadSpeed.460800.macosx=460800
pocket_32.menu.UploadSpeed.460800.upload.speed=460800
pocket_32.menu.UploadSpeed.512000.windows=512000
pocket_32.menu.UploadSpeed.512000.upload.speed=512000

pocket_32.menu.DebugLevel.none=None
pocket_32.menu.DebugLevel.none.build.code_debug=0
pocket_32.menu.DebugLevel.error=Error
pocket_32.menu.DebugLevel.error.build.code_debug=1
pocket_32.menu.DebugLevel.warn=Warn
pocket_32.menu.DebugLevel.warn.build.code_debug=2
pocket_32.menu.DebugLevel.info=Info
pocket_32.menu.DebugLevel.info.build.code_debug=3
pocket_32.menu.DebugLevel.debug=Debug
pocket_32.menu.DebugLevel.debug.build.code_debug=4
pocket_32.menu.DebugLevel.verbose=Verbose
pocket_32.menu.DebugLevel.verbose.build.code_debug=5

pocket_32.menu.EraseFlash.none=Disabled
pocket_32.menu.EraseFlash.none.upload.erase_cmd=
pocket_32.menu.EraseFlash.all=Enabled
pocket_32.menu.EraseFlash.all.upload.erase_cmd=-e

