xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

onehorse32dev.name=Onehorse ESP32 Dev Module

onehorse32dev.bootloader.tool=esptool_py
onehorse32dev.bootloader.tool.default=esptool_py

onehorse32dev.upload.tool=esptool_py
onehorse32dev.upload.tool.default=esptool_py
onehorse32dev.upload.tool.network=esp_ota

onehorse32dev.upload.maximum_size=1310720
onehorse32dev.upload.maximum_data_size=327680
onehorse32dev.upload.flags=
onehorse32dev.upload.extra_flags=

onehorse32dev.serial.disableDTR=true
onehorse32dev.serial.disableRTS=true

onehorse32dev.build.tarch=xtensa
onehorse32dev.build.bootloader_addr=0x1000
onehorse32dev.build.target=esp32
onehorse32dev.build.mcu=esp32
onehorse32dev.build.core=esp32
onehorse32dev.build.variant=onehorse32dev
onehorse32dev.build.board=ONEHORSE_ESP32_DEV

onehorse32dev.build.f_cpu=240000000L
onehorse32dev.build.flash_mode=dout
onehorse32dev.build.flash_size=4MB
onehorse32dev.build.boot=dio
onehorse32dev.build.partitions=default
onehorse32dev.build.defines=

onehorse32dev.menu.FlashFreq.80=80MHz
onehorse32dev.menu.FlashFreq.80.build.flash_freq=80m
onehorse32dev.menu.FlashFreq.40=40MHz
onehorse32dev.menu.FlashFreq.40.build.flash_freq=40m

onehorse32dev.menu.UploadSpeed.921600=921600
onehorse32dev.menu.UploadSpeed.921600.upload.speed=921600
onehorse32dev.menu.UploadSpeed.115200=115200
onehorse32dev.menu.UploadSpeed.115200.upload.speed=115200
onehorse32dev.menu.UploadSpeed.256000.windows=256000
onehorse32dev.menu.UploadSpeed.256000.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400=230400
onehorse32dev.menu.UploadSpeed.230400.upload.speed=230400
onehorse32dev.menu.UploadSpeed.460800.linux=460800
onehorse32dev.menu.UploadSpeed.460800.macosx=460800
onehorse32dev.menu.UploadSpeed.460800.upload.speed=460800
onehorse32dev.menu.UploadSpeed.512000.windows=512000
onehorse32dev.menu.UploadSpeed.512000.upload.speed=512000

onehorse32dev.menu.DebugLevel.none=None
onehorse32dev.menu.DebugLevel.none.build.code_debug=0
onehorse32dev.menu.DebugLevel.error=Error
onehorse32dev.menu.DebugLevel.error.build.code_debug=1
onehorse32dev.menu.DebugLevel.warn=Warn
onehorse32dev.menu.DebugLevel.warn.build.code_debug=2
onehorse32dev.menu.DebugLevel.info=Info
onehorse32dev.menu.DebugLevel.info.build.code_debug=3
onehorse32dev.menu.DebugLevel.debug=Debug
onehorse32dev.menu.DebugLevel.debug.build.code_debug=4
onehorse32dev.menu.DebugLevel.verbose=Verbose
onehorse32dev.menu.DebugLevel.verbose.build.code_debug=5

onehorse32dev.menu.EraseFlash.none=Disabled
onehorse32dev.menu.EraseFlash.none.upload.erase_cmd=
onehorse32dev.menu.EraseFlash.all=Enabled
onehorse32dev.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Metro ESP32-S3

adafruit_metro_esp32s3.name=Adafruit Metro ESP32-S3
adafruit_metro_esp32s3.vid.0=0x239A
adafruit_metro_esp32s3.pid.0=0x8145
adafruit_metro_esp32s3.vid.1=0x239A
adafruit_metro_esp32s3.pid.1=0x0145
adafruit_metro_esp32s3.vid.2=0x239A
adafruit_metro_esp32s3.pid.2=0x8146

adafruit_metro_esp32s3.bootloader.tool=esptool_py
adafruit_metro_esp32s3.bootloader.tool.default=esptool_py

adafruit_metro_esp32s3.upload.tool=esptool_py
adafruit_metro_esp32s3.upload.tool.default=esptool_py
adafruit_metro_esp32s3.upload.tool.network=esp_ota

adafruit_metro_esp32s3.upload.maximum_size=1310720
adafruit_metro_esp32s3.upload.maximum_data_size=327680
adafruit_metro_esp32s3.upload.flags=
adafruit_metro_esp32s3.upload.extra_flags=
adafruit_metro_esp32s3.upload.use_1200bps_touch=true
adafruit_metro_esp32s3.upload.wait_for_upload_port=true

adafruit_metro_esp32s3.serial.disableDTR=false
adafruit_metro_esp32s3.serial.disableRTS=false

adafruit_metro_esp32s3.build.tarch=xtensa
adafruit_metro_esp32s3.build.bootloader_addr=0x0
adafruit_metro_esp32s3.build.target=esp32s3
adafruit_metro_esp32s3.build.mcu=esp32s3
adafruit_metro_esp32s3.build.core=esp32
adafruit_metro_esp32s3.build.variant=adafruit_metro_esp32s3
adafruit_metro_esp32s3.build.board=METRO_ESP32S3

adafruit_metro_esp32s3.build.usb_mode=0
adafruit_metro_esp32s3.build.cdc_on_boot=1
adafruit_metro_esp32s3.build.msc_on_boot=0
adafruit_metro_esp32s3.build.dfu_on_boot=0
adafruit_metro_esp32s3.build.f_cpu=240000000L
adafruit_metro_esp32s3.build.flash_size=16MB
adafruit_metro_esp32s3.build.flash_freq=80m
adafruit_metro_esp32s3.build.flash_mode=dio
adafruit_metro_esp32s3.build.boot=qio
adafruit_metro_esp32s3.build.partitions=default
adafruit_metro_esp32s3.build.defines=
adafruit_metro_esp32s3.build.loop_core=
adafruit_metro_esp32s3.build.event_core=
adafruit_metro_esp32s3.build.flash_type=qio
adafruit_metro_esp32s3.build.psram_type=opi
adafruit_metro_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_metro_esp32s3.menu.LoopCore.1=Core 1
adafruit_metro_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.LoopCore.0=Core 0
adafruit_metro_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.EventsCore.1=Core 1
adafruit_metro_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.EventsCore.0=Core 0
adafruit_metro_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_metro_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_metro_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_metro_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_metro_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_metro_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_metro_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_metro_esp32s3.menu.MSCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_metro_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_metro_esp32s3.menu.DFUOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

