xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################
# Adafruit ESP32 Feather

featheresp32.name=Adafruit ESP32 Feather

featheresp32.bootloader.tool=esptool_py
featheresp32.bootloader.tool.default=esptool_py

featheresp32.upload.tool=esptool_py
featheresp32.upload.tool.default=esptool_py
featheresp32.upload.tool.network=esp_ota

featheresp32.upload.maximum_size=1310720
featheresp32.upload.maximum_data_size=327680
featheresp32.upload.flags=
featheresp32.upload.extra_flags=

featheresp32.serial.disableDTR=true
featheresp32.serial.disableRTS=true

featheresp32.build.tarch=xtensa
featheresp32.build.bootloader_addr=0x1000
featheresp32.build.target=esp32
featheresp32.build.mcu=esp32
featheresp32.build.core=esp32
featheresp32.build.variant=feather_esp32
featheresp32.build.board=FEATHER_ESP32

featheresp32.build.f_cpu=240000000L
featheresp32.build.flash_size=4MB
featheresp32.build.flash_freq=80m
featheresp32.build.flash_mode=dio
featheresp32.build.boot=dio
featheresp32.build.partitions=default
featheresp32.build.defines=
featheresp32.build.loop_core=
featheresp32.build.event_core=

featheresp32.menu.LoopCore.1=Core 1
featheresp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
featheresp32.menu.LoopCore.0=Core 0
featheresp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

featheresp32.menu.EventsCore.1=Core 1
featheresp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
featheresp32.menu.EventsCore.0=Core 0
featheresp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

featheresp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
featheresp32.menu.PartitionScheme.default.build.partitions=default
featheresp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
featheresp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
featheresp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
featheresp32.menu.PartitionScheme.minimal.build.partitions=minimal
featheresp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
featheresp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
featheresp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
featheresp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
featheresp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
featheresp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
featheresp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
featheresp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
featheresp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
featheresp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
featheresp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
featheresp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
featheresp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
featheresp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

featheresp32.menu.CPUFreq.240=240MHz (WiFi/BT)
featheresp32.menu.CPUFreq.240.build.f_cpu=240000000L
featheresp32.menu.CPUFreq.160=160MHz (WiFi/BT)
featheresp32.menu.CPUFreq.160.build.f_cpu=160000000L
featheresp32.menu.CPUFreq.80=80MHz (WiFi/BT)
featheresp32.menu.CPUFreq.80.build.f_cpu=80000000L
featheresp32.menu.CPUFreq.40=40MHz
featheresp32.menu.CPUFreq.40.build.f_cpu=40000000L
featheresp32.menu.CPUFreq.20=20MHz
featheresp32.menu.CPUFreq.20.build.f_cpu=20000000L
featheresp32.menu.CPUFreq.10=10MHz
featheresp32.menu.CPUFreq.10.build.f_cpu=10000000L

featheresp32.menu.FlashFreq.80=80MHz
featheresp32.menu.FlashFreq.80.build.flash_freq=80m
featheresp32.menu.FlashFreq.40=40MHz
featheresp32.menu.FlashFreq.40.build.flash_freq=40m

featheresp32.menu.FlashSize.4M=4MB (32Mb)
featheresp32.menu.FlashSize.4M.build.flash_size=4MB

featheresp32.menu.UploadSpeed.921600=921600
featheresp32.menu.UploadSpeed.921600.upload.speed=921600
featheresp32.menu.UploadSpeed.115200=115200
featheresp32.menu.UploadSpeed.115200.upload.speed=115200
featheresp32.menu.UploadSpeed.256000.windows=256000
featheresp32.menu.UploadSpeed.256000.upload.speed=256000
featheresp32.menu.UploadSpeed.230400.windows.upload.speed=256000
featheresp32.menu.UploadSpeed.230400=230400
featheresp32.menu.UploadSpeed.230400.upload.speed=230400
featheresp32.menu.UploadSpeed.460800.linux=460800
featheresp32.menu.UploadSpeed.460800.macosx=460800
featheresp32.menu.UploadSpeed.460800.upload.speed=460800
featheresp32.menu.UploadSpeed.512000.windows=512000
featheresp32.menu.UploadSpeed.512000.upload.speed=512000

featheresp32.menu.DebugLevel.none=None
featheresp32.menu.DebugLevel.none.build.code_debug=0
featheresp32.menu.DebugLevel.error=Error
featheresp32.menu.DebugLevel.error.build.code_debug=1
featheresp32.menu.DebugLevel.warn=Warn
featheresp32.menu.DebugLevel.warn.build.code_debug=2
featheresp32.menu.DebugLevel.info=Info
featheresp32.menu.DebugLevel.info.build.code_debug=3
featheresp32.menu.DebugLevel.debug=Debug
featheresp32.menu.DebugLevel.debug.build.code_debug=4
featheresp32.menu.DebugLevel.verbose=Verbose
featheresp32.menu.DebugLevel.verbose.build.code_debug=5

featheresp32.menu.EraseFlash.none=Disabled
featheresp32.menu.EraseFlash.none.upload.erase_cmd=
featheresp32.menu.EraseFlash.all=Enabled
featheresp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Feather ESP32 V2

adafruit_feather_esp32_v2.name=Adafruit Feather ESP32 V2

adafruit_feather_esp32_v2.bootloader.tool=esptool_py
adafruit_feather_esp32_v2.bootloader.tool.default=esptool_py

adafruit_feather_esp32_v2.upload.tool=esptool_py
adafruit_feather_esp32_v2.upload.tool.default=esptool_py
adafruit_feather_esp32_v2.upload.tool.network=esp_ota

adafruit_feather_esp32_v2.upload.maximum_size=1310720
adafruit_feather_esp32_v2.upload.maximum_data_size=327680
adafruit_feather_esp32_v2.upload.flags=
adafruit_feather_esp32_v2.upload.extra_flags=

adafruit_feather_esp32_v2.serial.disableDTR=true
adafruit_feather_esp32_v2.serial.disableRTS=true

adafruit_feather_esp32_v2.build.tarch=xtensa
adafruit_feather_esp32_v2.build.bootloader_addr=0x1000
adafruit_feather_esp32_v2.build.target=esp32
adafruit_feather_esp32_v2.build.mcu=esp32
adafruit_feather_esp32_v2.build.core=esp32
adafruit_feather_esp32_v2.build.variant=adafruit_feather_esp32_v2
adafruit_feather_esp32_v2.build.board=ADAFRUIT_FEATHER_ESP32_V2

