xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
adafruit_feather_esp32_v2.build.f_cpu=240000000L
adafruit_feather_esp32_v2.build.flash_size=8MB
adafruit_feather_esp32_v2.build.flash_freq=80m
adafruit_feather_esp32_v2.build.flash_mode=dio
adafruit_feather_esp32_v2.build.boot=dio
adafruit_feather_esp32_v2.build.partitions=default
adafruit_feather_esp32_v2.build.defines=
adafruit_feather_esp32_v2.build.loop_core=
adafruit_feather_esp32_v2.build.event_core=

adafruit_feather_esp32_v2.menu.LoopCore.1=Core 1
adafruit_feather_esp32_v2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_feather_esp32_v2.menu.LoopCore.0=Core 0
adafruit_feather_esp32_v2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_feather_esp32_v2.menu.EventsCore.1=Core 1
adafruit_feather_esp32_v2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_feather_esp32_v2.menu.EventsCore.0=Core 0
adafruit_feather_esp32_v2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_feather_esp32_v2.menu.PSRAM.enabled=Enabled
adafruit_feather_esp32_v2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
adafruit_feather_esp32_v2.menu.PSRAM.disabled=Disabled
adafruit_feather_esp32_v2.menu.PSRAM.disabled.build.defines=

adafruit_feather_esp32_v2.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_feather_esp32_v2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_feather_esp32_v2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

adafruit_feather_esp32_v2.menu.CPUFreq.240=240MHz (WiFi/BT)
adafruit_feather_esp32_v2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_feather_esp32_v2.menu.CPUFreq.160=160MHz (WiFi/BT)
adafruit_feather_esp32_v2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32_v2.menu.CPUFreq.80=80MHz (WiFi/BT)
adafruit_feather_esp32_v2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32_v2.menu.CPUFreq.40=40MHz
adafruit_feather_esp32_v2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32_v2.menu.CPUFreq.20=20MHz
adafruit_feather_esp32_v2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32_v2.menu.CPUFreq.10=10MHz
adafruit_feather_esp32_v2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_feather_esp32_v2.menu.FlashFreq.80=80MHz
adafruit_feather_esp32_v2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_feather_esp32_v2.menu.FlashFreq.40=40MHz
adafruit_feather_esp32_v2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_feather_esp32_v2.menu.FlashSize.8M=8MB (64Mb)
adafruit_feather_esp32_v2.menu.FlashSize.8M.build.flash_size=8MB

adafruit_feather_esp32_v2.menu.UploadSpeed.921600=921600
adafruit_feather_esp32_v2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32_v2.menu.UploadSpeed.115200=115200
adafruit_feather_esp32_v2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32_v2.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32_v2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32_v2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32_v2.menu.UploadSpeed.230400=230400
adafruit_feather_esp32_v2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32_v2.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32_v2.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32_v2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32_v2.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32_v2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32_v2.menu.DebugLevel.none=None
adafruit_feather_esp32_v2.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32_v2.menu.DebugLevel.error=Error
adafruit_feather_esp32_v2.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32_v2.menu.DebugLevel.warn=Warn
adafruit_feather_esp32_v2.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32_v2.menu.DebugLevel.info=Info
adafruit_feather_esp32_v2.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32_v2.menu.DebugLevel.debug=Debug
adafruit_feather_esp32_v2.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32_v2.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32_v2.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32_v2.menu.EraseFlash.none=Disabled
adafruit_feather_esp32_v2.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32_v2.menu.EraseFlash.all=Enabled
adafruit_feather_esp32_v2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Feather ESP32-S3 2MB PSRAM

adafruit_feather_esp32s3.name=Adafruit Feather ESP32-S3 2MB PSRAM
adafruit_feather_esp32s3.vid.0=0x239A
adafruit_feather_esp32s3.pid.0=0x811B
adafruit_feather_esp32s3.vid.1=0x239A
adafruit_feather_esp32s3.pid.1=0x011B
adafruit_feather_esp32s3.vid.2=0x239A
adafruit_feather_esp32s3.pid.2=0x811C

adafruit_feather_esp32s3.bootloader.tool=esptool_py
adafruit_feather_esp32s3.bootloader.tool.default=esptool_py

adafruit_feather_esp32s3.upload.tool=esptool_py
adafruit_feather_esp32s3.upload.tool.default=esptool_py
adafruit_feather_esp32s3.upload.tool.network=esp_ota

adafruit_feather_esp32s3.upload.maximum_size=1310720
adafruit_feather_esp32s3.upload.maximum_data_size=327680
adafruit_feather_esp32s3.upload.flags=
adafruit_feather_esp32s3.upload.extra_flags=
adafruit_feather_esp32s3.upload.use_1200bps_touch=true
adafruit_feather_esp32s3.upload.wait_for_upload_port=true

adafruit_feather_esp32s3.serial.disableDTR=false
adafruit_feather_esp32s3.serial.disableRTS=false

adafruit_feather_esp32s3.build.tarch=xtensa
adafruit_feather_esp32s3.build.bootloader_addr=0x0
adafruit_feather_esp32s3.build.target=esp32s3
adafruit_feather_esp32s3.build.mcu=esp32s3
adafruit_feather_esp32s3.build.core=esp32
adafruit_feather_esp32s3.build.variant=adafruit_feather_esp32s3
adafruit_feather_esp32s3.build.board=ADAFRUIT_FEATHER_ESP32S3

adafruit_feather_esp32s3.build.usb_mode=0
adafruit_feather_esp32s3.build.cdc_on_boot=1
adafruit_feather_esp32s3.build.msc_on_boot=0
adafruit_feather_esp32s3.build.dfu_on_boot=0
adafruit_feather_esp32s3.build.f_cpu=240000000L
adafruit_feather_esp32s3.build.flash_size=4MB
adafruit_feather_esp32s3.build.flash_freq=80m
adafruit_feather_esp32s3.build.flash_mode=dio
adafruit_feather_esp32s3.build.boot=qio
adafruit_feather_esp32s3.build.partitions=default
adafruit_feather_esp32s3.build.defines=
adafruit_feather_esp32s3.build.loop_core=
adafruit_feather_esp32s3.build.event_core=
adafruit_feather_esp32s3.build.flash_type=qio
adafruit_feather_esp32s3.build.psram_type=qspi
adafruit_feather_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

