xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
adafruit_feather_esp32s3_tft.menu.CPUFreq.240=240MHz (WiFi)
adafruit_feather_esp32s3_tft.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_feather_esp32s3_tft.menu.CPUFreq.160=160MHz (WiFi)
adafruit_feather_esp32s3_tft.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32s3_tft.menu.CPUFreq.80=80MHz (WiFi)
adafruit_feather_esp32s3_tft.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32s3_tft.menu.CPUFreq.40=40MHz
adafruit_feather_esp32s3_tft.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32s3_tft.menu.CPUFreq.20=20MHz
adafruit_feather_esp32s3_tft.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32s3_tft.menu.CPUFreq.10=10MHz
adafruit_feather_esp32s3_tft.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_feather_esp32s3_tft.menu.FlashMode.qio=QIO 80MHz
adafruit_feather_esp32s3_tft.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s3_tft.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s3_tft.menu.FlashMode.qio.build.boot_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.qio.build.flash_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.qio120=QIO 120MHz
adafruit_feather_esp32s3_tft.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_feather_esp32s3_tft.menu.FlashMode.qio120.build.boot=qio
adafruit_feather_esp32s3_tft.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_feather_esp32s3_tft.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.dio=DIO 80MHz
adafruit_feather_esp32s3_tft.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s3_tft.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s3_tft.menu.FlashMode.dio.build.boot_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.dio.build.flash_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.opi=OPI 80MHz
adafruit_feather_esp32s3_tft.menu.FlashMode.opi.build.flash_mode=dout
adafruit_feather_esp32s3_tft.menu.FlashMode.opi.build.boot=opi
adafruit_feather_esp32s3_tft.menu.FlashMode.opi.build.boot_freq=80m
adafruit_feather_esp32s3_tft.menu.FlashMode.opi.build.flash_freq=80m

adafruit_feather_esp32s3_tft.menu.FlashSize.4M=4MB (32Mb)
adafruit_feather_esp32s3_tft.menu.FlashSize.4M.build.flash_size=4MB

adafruit_feather_esp32s3_tft.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s3_tft.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s3_tft.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s3_tft.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s3_tft.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s3_tft.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s3_tft.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s3_tft.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s3_tft.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s3_tft.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s3_tft.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s3_tft.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s3_tft.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s3_tft.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s3_tft.menu.DebugLevel.none=None
adafruit_feather_esp32s3_tft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3_tft.menu.DebugLevel.error=Error
adafruit_feather_esp32s3_tft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3_tft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3_tft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3_tft.menu.DebugLevel.info=Info
adafruit_feather_esp32s3_tft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3_tft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3_tft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3_tft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3_tft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3_tft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3_tft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3_tft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3_tft.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Feather ESP32-S3 Reverse TFT

adafruit_feather_esp32s3_reversetft.name=Adafruit Feather ESP32-S3 Reverse TFT
adafruit_feather_esp32s3_reversetft.vid.0=0x239A
adafruit_feather_esp32s3_reversetft.pid.0=0x8123
adafruit_feather_esp32s3_reversetft.vid.1=0x239A
adafruit_feather_esp32s3_reversetft.pid.1=0x0123
adafruit_feather_esp32s3_reversetft.vid.2=0x239A
adafruit_feather_esp32s3_reversetft.pid.2=0x8124

adafruit_feather_esp32s3_reversetft.bootloader.tool=esptool_py
adafruit_feather_esp32s3_reversetft.bootloader.tool.default=esptool_py

adafruit_feather_esp32s3_reversetft.upload.tool=esptool_py
adafruit_feather_esp32s3_reversetft.upload.tool.default=esptool_py
adafruit_feather_esp32s3_reversetft.upload.tool.network=esp_ota

adafruit_feather_esp32s3_reversetft.upload.maximum_size=1310720
adafruit_feather_esp32s3_reversetft.upload.maximum_data_size=327680
adafruit_feather_esp32s3_reversetft.upload.flags=
adafruit_feather_esp32s3_reversetft.upload.extra_flags=
adafruit_feather_esp32s3_reversetft.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_reversetft.upload.wait_for_upload_port=true

adafruit_feather_esp32s3_reversetft.serial.disableDTR=false
adafruit_feather_esp32s3_reversetft.serial.disableRTS=false

adafruit_feather_esp32s3_reversetft.build.tarch=xtensa
adafruit_feather_esp32s3_reversetft.build.bootloader_addr=0x0
adafruit_feather_esp32s3_reversetft.build.target=esp32s3
adafruit_feather_esp32s3_reversetft.build.mcu=esp32s3
adafruit_feather_esp32s3_reversetft.build.core=esp32
adafruit_feather_esp32s3_reversetft.build.variant=adafruit_feather_esp32s3_reversetft
adafruit_feather_esp32s3_reversetft.build.board=ADAFRUIT_FEATHER_ESP32S3_REVTFT

adafruit_feather_esp32s3_reversetft.build.usb_mode=0
adafruit_feather_esp32s3_reversetft.build.cdc_on_boot=1
adafruit_feather_esp32s3_reversetft.build.msc_on_boot=0
adafruit_feather_esp32s3_reversetft.build.dfu_on_boot=0
adafruit_feather_esp32s3_reversetft.build.f_cpu=240000000L
adafruit_feather_esp32s3_reversetft.build.flash_size=4MB
adafruit_feather_esp32s3_reversetft.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.build.boot=qio
adafruit_feather_esp32s3_reversetft.build.partitions=default
adafruit_feather_esp32s3_reversetft.build.defines=
adafruit_feather_esp32s3_reversetft.build.loop_core=
adafruit_feather_esp32s3_reversetft.build.event_core=
adafruit_feather_esp32s3_reversetft.build.flash_type=qio
adafruit_feather_esp32s3_reversetft.build.psram_type=qspi
adafruit_feather_esp32s3_reversetft.build.memory_type={build.flash_type}_{build.psram_type}

