xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2=TinyUF2 8MB (2MB APP/3.7MB FATFS)
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-8MB-tinyuf2
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.240=240MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio=QIO 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120=QIO 120MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio=DIO 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.boot=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi=OPI 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.flash_mode=dout
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.boot=opi
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.flash_freq=80m

adafruit_qtpy_esp32s3_nopsram.menu.FlashSize.8M=8MB (64Mb)
adafruit_qtpy_esp32s3_nopsram.menu.FlashSize.8M.build.flash_size=8MB

adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.none=None
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.error=Error
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.info=Info
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.verbose.build.code_debug=5

adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.none=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.none.upload.erase_cmd=
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.all=Enabled
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit QT Py ESP32-S3 (4M Flash 2M PSRAM)

adafruit_qtpy_esp32s3_n4r2.name=Adafruit QT Py ESP32-S3 (4M Flash 2M PSRAM)
adafruit_qtpy_esp32s3_n4r2.vid.0=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.0=0x8143
adafruit_qtpy_esp32s3_n4r2.vid.1=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.1=0x0143
adafruit_qtpy_esp32s3_n4r2.vid.2=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.2=0x8144

adafruit_qtpy_esp32s3_n4r2.bootloader.tool=esptool_py
adafruit_qtpy_esp32s3_n4r2.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32s3_n4r2.upload.tool=esptool_py
adafruit_qtpy_esp32s3_n4r2.upload.tool.default=esptool_py
adafruit_qtpy_esp32s3_n4r2.upload.tool.network=esp_ota

adafruit_qtpy_esp32s3_n4r2.upload.maximum_size=1310720
adafruit_qtpy_esp32s3_n4r2.upload.maximum_data_size=327680
adafruit_qtpy_esp32s3_n4r2.upload.flags=
adafruit_qtpy_esp32s3_n4r2.upload.extra_flags=
adafruit_qtpy_esp32s3_n4r2.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_n4r2.upload.wait_for_upload_port=true

adafruit_qtpy_esp32s3_n4r2.serial.disableDTR=false
adafruit_qtpy_esp32s3_n4r2.serial.disableRTS=false

adafruit_qtpy_esp32s3_n4r2.build.tarch=xtensa
adafruit_qtpy_esp32s3_n4r2.build.bootloader_addr=0x0
adafruit_qtpy_esp32s3_n4r2.build.target=esp32s3
adafruit_qtpy_esp32s3_n4r2.build.mcu=esp32s3
adafruit_qtpy_esp32s3_n4r2.build.core=esp32
adafruit_qtpy_esp32s3_n4r2.build.variant=adafruit_qtpy_esp32s3_n4r2
adafruit_qtpy_esp32s3_n4r2.build.board=ADAFRUIT_QTPY_ESP32S3_N4R2

adafruit_qtpy_esp32s3_n4r2.build.usb_mode=0
adafruit_qtpy_esp32s3_n4r2.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_n4r2.build.msc_on_boot=0
adafruit_qtpy_esp32s3_n4r2.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_n4r2.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_n4r2.build.flash_size=4MB
adafruit_qtpy_esp32s3_n4r2.build.flash_freq=80m
adafruit_qtpy_esp32s3_n4r2.build.flash_mode=dio
adafruit_qtpy_esp32s3_n4r2.build.boot=qio
adafruit_qtpy_esp32s3_n4r2.build.partitions=default
adafruit_qtpy_esp32s3_n4r2.build.defines=
adafruit_qtpy_esp32s3_n4r2.build.loop_core=
adafruit_qtpy_esp32s3_n4r2.build.event_core=
adafruit_qtpy_esp32s3_n4r2.build.flash_type=qio
adafruit_qtpy_esp32s3_n4r2.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.1=Core 1
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.0=Core 0
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.1=Core 1
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.0=Core 0
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

