xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.default.build.usb_mode=0
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.cdc=Enabled
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled=QSPI PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled.build.defines=
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi=OPI PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi.build.psram_type=opi

adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-4MB-tinyuf2
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.default.build.partitions=default
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio=QIO 80MHz
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio.build.boot=qio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio.build.boot_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio.build.flash_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio120=QIO 120MHz
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio120.build.boot=qio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.dio=DIO 80MHz
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.dio.build.boot=dio
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.dio.build.boot_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.dio.build.flash_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.opi=OPI 80MHz
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.opi.build.flash_mode=dout
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.opi.build.boot=opi
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.opi.build.boot_freq=80m
adafruit_qtpy_esp32s3_n4r2.menu.FlashMode.opi.build.flash_freq=80m

adafruit_qtpy_esp32s3_n4r2.menu.FlashSize.4M=4MB (32Mb)
adafruit_qtpy_esp32s3_n4r2.menu.FlashSize.4M.build.flash_size=4MB

