xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
adafruit_camera_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
adafruit_camera_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_camera_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
adafruit_camera_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_camera_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
adafruit_camera_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_camera_esp32s3.menu.CPUFreq.40=40MHz
adafruit_camera_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_camera_esp32s3.menu.CPUFreq.20=20MHz
adafruit_camera_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_camera_esp32s3.menu.CPUFreq.10=10MHz
adafruit_camera_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_camera_esp32s3.menu.FlashMode.qio=QIO 80MHz
adafruit_camera_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
adafruit_camera_esp32s3.menu.FlashMode.qio.build.boot=qio
adafruit_camera_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.qio120=QIO 120MHz
adafruit_camera_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_camera_esp32s3.menu.FlashMode.qio120.build.boot=qio
adafruit_camera_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_camera_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.dio=DIO 80MHz
adafruit_camera_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
adafruit_camera_esp32s3.menu.FlashMode.dio.build.boot=dio
adafruit_camera_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.opi=OPI 80MHz
adafruit_camera_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
adafruit_camera_esp32s3.menu.FlashMode.opi.build.boot=opi
adafruit_camera_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
adafruit_camera_esp32s3.menu.FlashMode.opi.build.flash_freq=80m

adafruit_camera_esp32s3.menu.FlashSize.4M=4MB (32Mb)
adafruit_camera_esp32s3.menu.FlashSize.4M.build.flash_size=4MB

adafruit_camera_esp32s3.menu.UploadSpeed.921600=921600
adafruit_camera_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
adafruit_camera_esp32s3.menu.UploadSpeed.115200=115200
adafruit_camera_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
adafruit_camera_esp32s3.menu.UploadSpeed.256000.windows=256000
adafruit_camera_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
adafruit_camera_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_camera_esp32s3.menu.UploadSpeed.230400=230400
adafruit_camera_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
adafruit_camera_esp32s3.menu.UploadSpeed.460800.linux=460800
adafruit_camera_esp32s3.menu.UploadSpeed.460800.macosx=460800
adafruit_camera_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
adafruit_camera_esp32s3.menu.UploadSpeed.512000.windows=512000
adafruit_camera_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

adafruit_camera_esp32s3.menu.DebugLevel.none=None
adafruit_camera_esp32s3.menu.DebugLevel.none.build.code_debug=0
adafruit_camera_esp32s3.menu.DebugLevel.error=Error
adafruit_camera_esp32s3.menu.DebugLevel.error.build.code_debug=1
adafruit_camera_esp32s3.menu.DebugLevel.warn=Warn
adafruit_camera_esp32s3.menu.DebugLevel.warn.build.code_debug=2
adafruit_camera_esp32s3.menu.DebugLevel.info=Info
adafruit_camera_esp32s3.menu.DebugLevel.info.build.code_debug=3
adafruit_camera_esp32s3.menu.DebugLevel.debug=Debug
adafruit_camera_esp32s3.menu.DebugLevel.debug.build.code_debug=4
adafruit_camera_esp32s3.menu.DebugLevel.verbose=Verbose
adafruit_camera_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

adafruit_camera_esp32s3.menu.EraseFlash.none=Disabled
adafruit_camera_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
adafruit_camera_esp32s3.menu.EraseFlash.all=Enabled
adafruit_camera_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################
# Adafruit Qualia ESP32-S3 RGB666

adafruit_qualia_s3_rgb666.name=Adafruit Qualia ESP32-S3 RGB666
adafruit_qualia_s3_rgb666.vid.0=0x239A
adafruit_qualia_s3_rgb666.pid.0=0x8147
adafruit_qualia_s3_rgb666.vid.1=0x239A
adafruit_qualia_s3_rgb666.pid.1=0x0147
adafruit_qualia_s3_rgb666.vid.2=0x239A
adafruit_qualia_s3_rgb666.pid.2=0x8148

adafruit_qualia_s3_rgb666.bootloader.tool=esptool_py
adafruit_qualia_s3_rgb666.bootloader.tool.default=esptool_py

adafruit_qualia_s3_rgb666.upload.tool=esptool_py
adafruit_qualia_s3_rgb666.upload.tool.default=esptool_py
adafruit_qualia_s3_rgb666.upload.tool.network=esp_ota

adafruit_qualia_s3_rgb666.upload.maximum_size=1310720
adafruit_qualia_s3_rgb666.upload.maximum_data_size=327680
adafruit_qualia_s3_rgb666.upload.flags=
adafruit_qualia_s3_rgb666.upload.extra_flags=
adafruit_qualia_s3_rgb666.upload.use_1200bps_touch=true
adafruit_qualia_s3_rgb666.upload.wait_for_upload_port=true

adafruit_qualia_s3_rgb666.serial.disableDTR=false
adafruit_qualia_s3_rgb666.serial.disableRTS=false

adafruit_qualia_s3_rgb666.build.tarch=xtensa
adafruit_qualia_s3_rgb666.build.bootloader_addr=0x0
adafruit_qualia_s3_rgb666.build.target=esp32s3
adafruit_qualia_s3_rgb666.build.mcu=esp32s3
adafruit_qualia_s3_rgb666.build.core=esp32
adafruit_qualia_s3_rgb666.build.variant=adafruit_qualia_s3_rgb666
adafruit_qualia_s3_rgb666.build.board=QUALIA_S3_RGB666

adafruit_qualia_s3_rgb666.build.usb_mode=0
adafruit_qualia_s3_rgb666.build.cdc_on_boot=1
adafruit_qualia_s3_rgb666.build.msc_on_boot=0
adafruit_qualia_s3_rgb666.build.dfu_on_boot=0
adafruit_qualia_s3_rgb666.build.f_cpu=240000000L
adafruit_qualia_s3_rgb666.build.flash_size=16MB
adafruit_qualia_s3_rgb666.build.flash_freq=80m
adafruit_qualia_s3_rgb666.build.flash_mode=dio
adafruit_qualia_s3_rgb666.build.boot=qio
adafruit_qualia_s3_rgb666.build.partitions=default
adafruit_qualia_s3_rgb666.build.defines=
adafruit_qualia_s3_rgb666.build.loop_core=
adafruit_qualia_s3_rgb666.build.event_core=
adafruit_qualia_s3_rgb666.build.flash_type=qio
adafruit_qualia_s3_rgb666.build.psram_type=opi
adafruit_qualia_s3_rgb666.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_qualia_s3_rgb666.menu.LoopCore.1=Core 1
adafruit_qualia_s3_rgb666.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_qualia_s3_rgb666.menu.LoopCore.0=Core 0
adafruit_qualia_s3_rgb666.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

