xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

esp32-poe-iso.name=OLIMEX ESP32-PoE-ISO

esp32-poe-iso.bootloader.tool=esptool_py
esp32-poe-iso.bootloader.tool.default=esptool_py

esp32-poe-iso.upload.tool=esptool_py
esp32-poe-iso.upload.tool.default=esptool_py
esp32-poe-iso.upload.tool.network=esp_ota

esp32-poe-iso.upload.maximum_size=1310720
esp32-poe-iso.upload.maximum_data_size=327680
esp32-poe-iso.upload.flags=
esp32-poe-iso.upload.extra_flags=

esp32-poe-iso.serial.disableDTR=true
esp32-poe-iso.serial.disableRTS=true

esp32-poe-iso.build.tarch=xtensa
esp32-poe-iso.build.bootloader_addr=0x1000
esp32-poe-iso.build.target=esp32
esp32-poe-iso.build.mcu=esp32
esp32-poe-iso.build.core=esp32
esp32-poe-iso.build.variant=esp32-poe-iso
esp32-poe-iso.build.board=ESP32_POE_ISO

esp32-poe-iso.build.f_cpu=240000000L
esp32-poe-iso.build.flash_mode=dio
esp32-poe-iso.build.flash_size=4MB
esp32-poe-iso.build.boot=dio
esp32-poe-iso.build.partitions=default
esp32-poe-iso.build.defines=

esp32-poe-iso.menu.FlashFreq.80=80MHz
esp32-poe-iso.menu.FlashFreq.80.build.flash_freq=80m
esp32-poe-iso.menu.FlashFreq.40=40MHz
esp32-poe-iso.menu.FlashFreq.40.build.flash_freq=40m

esp32-poe-iso.menu.UploadSpeed.115200=115200
esp32-poe-iso.menu.UploadSpeed.115200.upload.speed=115200

esp32-poe-iso.menu.PartitionScheme.default=Default
esp32-poe-iso.menu.PartitionScheme.default.build.partitions=default
esp32-poe-iso.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-poe-iso.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-poe-iso.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-poe-iso.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-poe-iso.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-poe-iso.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

esp32-poe-iso.menu.DebugLevel.none=None
esp32-poe-iso.menu.DebugLevel.none.build.code_debug=0
esp32-poe-iso.menu.DebugLevel.error=Error
esp32-poe-iso.menu.DebugLevel.error.build.code_debug=1
esp32-poe-iso.menu.DebugLevel.warn=Warn
esp32-poe-iso.menu.DebugLevel.warn.build.code_debug=2
esp32-poe-iso.menu.DebugLevel.info=Info
esp32-poe-iso.menu.DebugLevel.info.build.code_debug=3
esp32-poe-iso.menu.DebugLevel.debug=Debug
esp32-poe-iso.menu.DebugLevel.debug.build.code_debug=4
esp32-poe-iso.menu.DebugLevel.verbose=Verbose
esp32-poe-iso.menu.DebugLevel.verbose.build.code_debug=5

esp32-poe-iso.menu.EraseFlash.none=Disabled
esp32-poe-iso.menu.EraseFlash.none.upload.erase_cmd=
esp32-poe-iso.menu.EraseFlash.all=Enabled
esp32-poe-iso.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32-DevKitLipo.name=OLIMEX ESP32-DevKit-LiPo

esp32-DevKitLipo.bootloader.tool=esptool_py
esp32-DevKitLipo.bootloader.tool.default=esptool_py

esp32-DevKitLipo.upload.tool=esptool_py
esp32-DevKitLipo.upload.tool.default=esptool_py
esp32-DevKitLipo.upload.tool.network=esp_ota

esp32-DevKitLipo.upload.maximum_size=1310720
esp32-DevKitLipo.upload.maximum_data_size=327680
esp32-DevKitLipo.upload.flags=
esp32-DevKitLipo.upload.extra_flags=

esp32-DevKitLipo.serial.disableDTR=true
esp32-DevKitLipo.serial.disableRTS=true

esp32-DevKitLipo.build.tarch=xtensa
esp32-DevKitLipo.build.bootloader_addr=0x1000
esp32-DevKitLipo.build.target=esp32
esp32-DevKitLipo.build.mcu=esp32
esp32-DevKitLipo.build.core=esp32
esp32-DevKitLipo.build.variant=esp32-devkit-lipo
esp32-DevKitLipo.build.board=ESP32_DEVKIT_LIPO

esp32-DevKitLipo.build.f_cpu=240000000L
esp32-DevKitLipo.build.flash_size=4MB
esp32-DevKitLipo.build.flash_freq=40m
esp32-DevKitLipo.build.flash_mode=dio
esp32-DevKitLipo.build.boot=dio
esp32-DevKitLipo.build.partitions=default
esp32-DevKitLipo.build.defines=

esp32-DevKitLipo.menu.PartitionScheme.default=Default
esp32-DevKitLipo.menu.PartitionScheme.default.build.partitions=default
esp32-DevKitLipo.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
esp32-DevKitLipo.menu.PartitionScheme.minimal.build.partitions=minimal
esp32-DevKitLipo.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-DevKitLipo.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-DevKitLipo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-DevKitLipo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
esp32-DevKitLipo.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32-DevKitLipo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32-DevKitLipo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-DevKitLipo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-DevKitLipo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32-DevKitLipo.menu.PartitionScheme.fatflash=16M Fat
esp32-DevKitLipo.menu.PartitionScheme.fatflash.build.partitions=ffat

esp32-DevKitLipo.menu.FlashMode.qio=QIO
esp32-DevKitLipo.menu.FlashMode.qio.build.flash_mode=dio
esp32-DevKitLipo.menu.FlashMode.qio.build.boot=qio
esp32-DevKitLipo.menu.FlashMode.dio=DIO
esp32-DevKitLipo.menu.FlashMode.dio.build.flash_mode=dio
esp32-DevKitLipo.menu.FlashMode.dio.build.boot=dio
esp32-DevKitLipo.menu.FlashMode.qout=QOUT
esp32-DevKitLipo.menu.FlashMode.qout.build.flash_mode=dout
esp32-DevKitLipo.menu.FlashMode.qout.build.boot=qout
esp32-DevKitLipo.menu.FlashMode.dout=DOUT
esp32-DevKitLipo.menu.FlashMode.dout.build.flash_mode=dout
esp32-DevKitLipo.menu.FlashMode.dout.build.boot=dout

esp32-DevKitLipo.menu.FlashFreq.80=80MHz
esp32-DevKitLipo.menu.FlashFreq.80.build.flash_freq=80m
esp32-DevKitLipo.menu.FlashFreq.40=40MHz
esp32-DevKitLipo.menu.FlashFreq.40.build.flash_freq=40m

esp32-DevKitLipo.menu.UploadSpeed.921600=921600
esp32-DevKitLipo.menu.UploadSpeed.921600.upload.speed=921600
esp32-DevKitLipo.menu.UploadSpeed.115200=115200
esp32-DevKitLipo.menu.UploadSpeed.115200.upload.speed=115200
esp32-DevKitLipo.menu.UploadSpeed.256000.windows=256000
esp32-DevKitLipo.menu.UploadSpeed.256000.upload.speed=256000
esp32-DevKitLipo.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-DevKitLipo.menu.UploadSpeed.230400=230400
esp32-DevKitLipo.menu.UploadSpeed.230400.upload.speed=230400
esp32-DevKitLipo.menu.UploadSpeed.460800.linux=460800
esp32-DevKitLipo.menu.UploadSpeed.460800.macosx=460800
esp32-DevKitLipo.menu.UploadSpeed.460800.upload.speed=460800
esp32-DevKitLipo.menu.UploadSpeed.512000.windows=512000
esp32-DevKitLipo.menu.UploadSpeed.512000.upload.speed=512000

esp32-DevKitLipo.menu.DebugLevel.none=None
esp32-DevKitLipo.menu.DebugLevel.none.build.code_debug=0
esp32-DevKitLipo.menu.DebugLevel.error=Error
esp32-DevKitLipo.menu.DebugLevel.error.build.code_debug=1
esp32-DevKitLipo.menu.DebugLevel.warn=Warn
esp32-DevKitLipo.menu.DebugLevel.warn.build.code_debug=2
esp32-DevKitLipo.menu.DebugLevel.info=Info
esp32-DevKitLipo.menu.DebugLevel.info.build.code_debug=3
esp32-DevKitLipo.menu.DebugLevel.debug=Debug
esp32-DevKitLipo.menu.DebugLevel.debug.build.code_debug=4
esp32-DevKitLipo.menu.DebugLevel.verbose=Verbose
esp32-DevKitLipo.menu.DebugLevel.verbose.build.code_debug=5

