xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
m5stack-cores3.menu.EraseFlash.none=Disabled
m5stack-cores3.menu.EraseFlash.none.upload.erase_cmd=
m5stack-cores3.menu.EraseFlash.all=Enabled
m5stack-cores3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-timer-cam.name=M5Stack-Timer-CAM

m5stack-timer-cam.bootloader.tool=esptool_py
m5stack-timer-cam.bootloader.tool.default=esptool_py

m5stack-timer-cam.upload.tool=esptool_py
m5stack-timer-cam.upload.tool.default=esptool_py
m5stack-timer-cam.upload.tool.network=esp_ota

m5stack-timer-cam.upload.maximum_size=1310720
m5stack-timer-cam.upload.maximum_data_size=327680
m5stack-timer-cam.upload.wait_for_upload_port=true
m5stack-timer-cam.upload.flags=
m5stack-timer-cam.upload.extra_flags=

m5stack-timer-cam.serial.disableDTR=true
m5stack-timer-cam.serial.disableRTS=true

m5stack-timer-cam.build.tarch=xtensa
m5stack-timer-cam.build.bootloader_addr=0x1000
m5stack-timer-cam.build.target=esp32
m5stack-timer-cam.build.mcu=esp32
m5stack-timer-cam.build.core=esp32
m5stack-timer-cam.build.variant=m5stack_timer_cam
m5stack-timer-cam.build.board=M5Stack-Timer-CAM

m5stack-timer-cam.build.f_cpu=240000000L
m5stack-timer-cam.build.flash_size=4MB
m5stack-timer-cam.build.flash_freq=80m
m5stack-timer-cam.build.flash_mode=dio
m5stack-timer-cam.build.boot=dio
m5stack-timer-cam.build.partitions=default
m5stack-timer-cam.build.defines=

m5stack-timer-cam.menu.PSRAM.enabled=Enabled
m5stack-timer-cam.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack-timer-cam.menu.PSRAM.enabled.build.extra_libs=
m5stack-timer-cam.menu.PSRAM.disabled=Disabled
m5stack-timer-cam.menu.PSRAM.disabled.build.defines=
m5stack-timer-cam.menu.PSRAM.disabled.build.extra_libs=

m5stack-timer-cam.menu.PartitionScheme.default=Default(3MB No OTA/1MB SPIFFS)
m5stack-timer-cam.menu.PartitionScheme.default.build.partitions=huge_app
m5stack-timer-cam.menu.PartitionScheme.default.upload.maximum_size=3145728

m5stack-timer-cam.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-timer-cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-timer-cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

m5stack-timer-cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-timer-cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-timer-cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-timer-cam.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack-timer-cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-timer-cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

m5stack-timer-cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack-timer-cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-timer-cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-timer-cam.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-timer-cam.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-timer-cam.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-timer-cam.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-timer-cam.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-timer-cam.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-timer-cam.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-timer-cam.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-timer-cam.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-timer-cam.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-timer-cam.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-timer-cam.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-timer-cam.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-timer-cam.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-timer-cam.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-timer-cam.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-timer-cam.menu.UploadSpeed.1500000=1500000
m5stack-timer-cam.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack-timer-cam.menu.UploadSpeed.750000=750000
m5stack-timer-cam.menu.UploadSpeed.750000.upload.speed=750000
m5stack-timer-cam.menu.UploadSpeed.500000=500000
m5stack-timer-cam.menu.UploadSpeed.500000.upload.speed=500000
m5stack-timer-cam.menu.UploadSpeed.250000=250000
m5stack-timer-cam.menu.UploadSpeed.250000.upload.speed=250000
m5stack-timer-cam.menu.UploadSpeed.115200=115200
m5stack-timer-cam.menu.UploadSpeed.115200.upload.speed=115200

m5stack-timer-cam.menu.DebugLevel.none=None
m5stack-timer-cam.menu.DebugLevel.none.build.code_debug=0
m5stack-timer-cam.menu.DebugLevel.error=Error
m5stack-timer-cam.menu.DebugLevel.error.build.code_debug=1
m5stack-timer-cam.menu.DebugLevel.warn=Warn
m5stack-timer-cam.menu.DebugLevel.warn.build.code_debug=2
m5stack-timer-cam.menu.DebugLevel.info=Info
m5stack-timer-cam.menu.DebugLevel.info.build.code_debug=3
m5stack-timer-cam.menu.DebugLevel.debug=Debug
m5stack-timer-cam.menu.DebugLevel.debug.build.code_debug=4
m5stack-timer-cam.menu.DebugLevel.verbose=Verbose
m5stack-timer-cam.menu.DebugLevel.verbose.build.code_debug=5

m5stack-timer-cam.menu.EraseFlash.none=Disabled
m5stack-timer-cam.menu.EraseFlash.none.upload.erase_cmd=
m5stack-timer-cam.menu.EraseFlash.all=Enabled
m5stack-timer-cam.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-coreink.name=M5Stack-CoreInk

m5stack-coreink.bootloader.tool=esptool_py
m5stack-coreink.bootloader.tool.default=esptool_py

m5stack-coreink.upload.tool=esptool_py
m5stack-coreink.upload.tool.default=esptool_py
m5stack-coreink.upload.tool.network=esp_ota

m5stack-coreink.upload.maximum_size=1310720
m5stack-coreink.upload.maximum_data_size=327680
m5stack-coreink.upload.wait_for_upload_port=true
m5stack-coreink.upload.flags=
m5stack-coreink.upload.extra_flags=

m5stack-coreink.serial.disableDTR=true
m5stack-coreink.serial.disableRTS=true

m5stack-coreink.build.tarch=xtensa
m5stack-coreink.build.bootloader_addr=0x1000
m5stack-coreink.build.target=esp32
m5stack-coreink.build.mcu=esp32
m5stack-coreink.build.core=esp32
m5stack-coreink.build.variant=m5stack_coreink
m5stack-coreink.build.board=M5Stack_CoreInk

m5stack-coreink.build.f_cpu=240000000L
m5stack-coreink.build.flash_size=4MB
m5stack-coreink.build.flash_freq=80m
m5stack-coreink.build.flash_mode=dio
m5stack-coreink.build.boot=dio
m5stack-coreink.build.partitions=default
m5stack-coreink.build.defines=

