xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
d1_mini32.menu.EraseFlash.none=Disabled
d1_mini32.menu.EraseFlash.none.upload.erase_cmd=
d1_mini32.menu.EraseFlash.all=Enabled
d1_mini32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

d1_uno32.name=WEMOS D1 R32

d1_uno32.bootloader.tool=esptool_py
d1_uno32.bootloader.tool.default=esptool_py

d1_uno32.upload.tool=esptool_py
d1_uno32.upload.tool.default=esptool_py
d1_uno32.upload.tool.network=esp_ota

d1_uno32.upload.maximum_size=1310720
d1_uno32.upload.maximum_data_size=327680
d1_uno32.upload.flags=
d1_uno32.upload.extra_flags=

d1_uno32.serial.disableDTR=true
d1_uno32.serial.disableRTS=true

d1_uno32.build.tarch=xtensa
d1_uno32.build.bootloader_addr=0x1000
d1_uno32.build.target=esp32
d1_uno32.build.mcu=esp32
d1_uno32.build.core=esp32
d1_uno32.build.variant=d1_uno32
d1_uno32.build.board=D1_UNO32

d1_uno32.build.f_cpu=240000000L
d1_uno32.build.flash_mode=dio
d1_uno32.build.flash_size=4MB
d1_uno32.build.boot=dio
d1_uno32.build.partitions=default
d1_uno32.build.defines=

d1_uno32.menu.FlashFreq.80=80MHz
d1_uno32.menu.FlashFreq.80.build.flash_freq=80m
d1_uno32.menu.FlashFreq.40=40MHz
d1_uno32.menu.FlashFreq.40.build.flash_freq=40m

d1_uno32.menu.PartitionScheme.default=Default
d1_uno32.menu.PartitionScheme.default.build.partitions=default
d1_uno32.menu.PartitionScheme.no_ota=No OTA (Large APP)
d1_uno32.menu.PartitionScheme.no_ota.build.partitions=no_ota
d1_uno32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d1_uno32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d1_uno32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d1_uno32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

d1_uno32.menu.CPUFreq.240=240MHz (WiFi/BT)
d1_uno32.menu.CPUFreq.240.build.f_cpu=240000000L
d1_uno32.menu.CPUFreq.160=160MHz (WiFi/BT)
d1_uno32.menu.CPUFreq.160.build.f_cpu=160000000L
d1_uno32.menu.CPUFreq.80=80MHz (WiFi/BT)
d1_uno32.menu.CPUFreq.80.build.f_cpu=80000000L
d1_uno32.menu.CPUFreq.40=40MHz (40MHz XTAL)
d1_uno32.menu.CPUFreq.40.build.f_cpu=40000000L
d1_uno32.menu.CPUFreq.26=26MHz (26MHz XTAL)
d1_uno32.menu.CPUFreq.26.build.f_cpu=26000000L
d1_uno32.menu.CPUFreq.20=20MHz (40MHz XTAL)
d1_uno32.menu.CPUFreq.20.build.f_cpu=20000000L
d1_uno32.menu.CPUFreq.13=13MHz (26MHz XTAL)
d1_uno32.menu.CPUFreq.13.build.f_cpu=13000000L
d1_uno32.menu.CPUFreq.10=10MHz (40MHz XTAL)
d1_uno32.menu.CPUFreq.10.build.f_cpu=10000000L

d1_uno32.menu.UploadSpeed.921600=921600
d1_uno32.menu.UploadSpeed.921600.upload.speed=921600
d1_uno32.menu.UploadSpeed.115200=115200
d1_uno32.menu.UploadSpeed.115200.upload.speed=115200
d1_uno32.menu.UploadSpeed.256000.windows=256000
d1_uno32.menu.UploadSpeed.256000.upload.speed=256000
d1_uno32.menu.UploadSpeed.230400.windows.upload.speed=256000
d1_uno32.menu.UploadSpeed.230400=230400
d1_uno32.menu.UploadSpeed.230400.upload.speed=230400
d1_uno32.menu.UploadSpeed.460800.linux=460800
d1_uno32.menu.UploadSpeed.460800.macosx=460800
d1_uno32.menu.UploadSpeed.460800.upload.speed=460800
d1_uno32.menu.UploadSpeed.512000.windows=512000
d1_uno32.menu.UploadSpeed.512000.upload.speed=512000

d1_uno32.menu.DebugLevel.none=None
d1_uno32.menu.DebugLevel.none.build.code_debug=0
d1_uno32.menu.DebugLevel.error=Error
d1_uno32.menu.DebugLevel.error.build.code_debug=1
d1_uno32.menu.DebugLevel.warn=Warn
d1_uno32.menu.DebugLevel.warn.build.code_debug=2
d1_uno32.menu.DebugLevel.info=Info
d1_uno32.menu.DebugLevel.info.build.code_debug=3
d1_uno32.menu.DebugLevel.debug=Debug
d1_uno32.menu.DebugLevel.debug.build.code_debug=4
d1_uno32.menu.DebugLevel.verbose=Verbose
d1_uno32.menu.DebugLevel.verbose.build.code_debug=5

d1_uno32.menu.EraseFlash.none=Disabled
d1_uno32.menu.EraseFlash.none.upload.erase_cmd=
d1_uno32.menu.EraseFlash.all=Enabled
d1_uno32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

gpy.name=Pycom GPy

gpy.bootloader.tool=esptool_py
gpy.bootloader.tool.default=esptool_py

gpy.upload.tool=esptool_py
gpy.upload.tool.default=esptool_py
gpy.upload.tool.network=esp_ota

gpy.upload.maximum_size=1310720
gpy.upload.maximum_data_size=327680
gpy.upload.flags=
gpy.upload.extra_flags=

gpy.serial.disableDTR=true
gpy.serial.disableRTS=true

gpy.build.tarch=xtensa
gpy.build.bootloader_addr=0x1000
gpy.build.target=esp32
gpy.build.mcu=esp32
gpy.build.core=esp32
gpy.build.variant=gpy
gpy.build.board=PYCOM_GPY

gpy.build.f_cpu=240000000L
gpy.build.flash_mode=dio
gpy.build.flash_size=8MB
gpy.build.boot=dio
gpy.build.partitions=default

gpy.menu.FlashFreq.80=80MHz
gpy.menu.FlashFreq.80.build.flash_freq=80m
gpy.menu.FlashFreq.40=40MHz
gpy.menu.FlashFreq.40.build.flash_freq=40m

gpy.menu.UploadSpeed.921600=921600
gpy.menu.UploadSpeed.921600.upload.speed=921600
gpy.menu.UploadSpeed.115200=115200
gpy.menu.UploadSpeed.115200.upload.speed=115200
gpy.menu.UploadSpeed.256000.windows=256000
gpy.menu.UploadSpeed.256000.upload.speed=256000
gpy.menu.UploadSpeed.230400.windows.upload.speed=256000
gpy.menu.UploadSpeed.230400=230400
gpy.menu.UploadSpeed.230400.upload.speed=230400
gpy.menu.UploadSpeed.460800.linux=460800
gpy.menu.UploadSpeed.460800.macosx=460800
gpy.menu.UploadSpeed.460800.upload.speed=460800
gpy.menu.UploadSpeed.512000.windows=512000
gpy.menu.UploadSpeed.512000.upload.speed=512000

gpy.menu.DebugLevel.none=None
gpy.menu.DebugLevel.none.build.code_debug=0
gpy.menu.DebugLevel.error=Error
gpy.menu.DebugLevel.error.build.code_debug=1
gpy.menu.DebugLevel.warn=Warn
gpy.menu.DebugLevel.warn.build.code_debug=2
gpy.menu.DebugLevel.info=Info
gpy.menu.DebugLevel.info.build.code_debug=3
gpy.menu.DebugLevel.debug=Debug
gpy.menu.DebugLevel.debug.build.code_debug=4
gpy.menu.DebugLevel.verbose=Verbose
gpy.menu.DebugLevel.verbose.build.code_debug=5

gpy.menu.EraseFlash.none=Disabled
gpy.menu.EraseFlash.none.upload.erase_cmd=
gpy.menu.EraseFlash.all=Enabled
gpy.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

vintlabs-devkit-v1.name=VintLabs ESP32 Devkit

vintlabs-devkit-v1.bootloader.tool=esptool_py
vintlabs-devkit-v1.bootloader.tool.default=esptool_py

vintlabs-devkit-v1.upload.tool=esptool_py
vintlabs-devkit-v1.upload.tool.default=esptool_py
vintlabs-devkit-v1.upload.tool.network=esp_ota

vintlabs-devkit-v1.upload.maximum_size=1310720
vintlabs-devkit-v1.upload.maximum_data_size=327680
vintlabs-devkit-v1.upload.flags=
vintlabs-devkit-v1.upload.extra_flags=

