xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
wifiduino32c3.serial.disableDTR=false
wifiduino32c3.serial.disableRTS=false

wifiduino32c3.build.tarch=riscv32
wifiduino32c3.build.target=esp
wifiduino32c3.build.mcu=esp32c3
wifiduino32c3.build.core=esp32
wifiduino32c3.build.variant=wifiduinov2
wifiduino32c3.build.board=WiFiduinoV2
wifiduino32c3.build.bootloader_addr=0x0

wifiduino32c3.build.cdc_on_boot=0
wifiduino32c3.build.f_cpu=160000000L
wifiduino32c3.build.flash_size=4MB
wifiduino32c3.build.flash_freq=80m
wifiduino32c3.build.flash_mode=qio
wifiduino32c3.build.boot=qio
wifiduino32c3.build.partitions=default
wifiduino32c3.build.defines=

wifiduino32c3.menu.CDCOnBoot.default=Disabled
wifiduino32c3.menu.CDCOnBoot.default.build.cdc_on_boot=0
wifiduino32c3.menu.CDCOnBoot.cdc=Enabled
wifiduino32c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wifiduino32c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.default.build.partitions=default
wifiduino32c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wifiduino32c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wifiduino32c3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wifiduino32c3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wifiduino32c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wifiduino32c3.menu.PartitionScheme.minimal.build.partitions=minimal
wifiduino32c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wifiduino32c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wifiduino32c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wifiduino32c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wifiduino32c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wifiduino32c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wifiduino32c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wifiduino32c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
wifiduino32c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wifiduino32c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wifiduino32c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wifiduino32c3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
wifiduino32c3.menu.PartitionScheme.fatflash.build.partitions=ffat
wifiduino32c3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wifiduino32c3.menu.PartitionScheme.rainmaker=RainMaker
wifiduino32c3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wifiduino32c3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

wifiduino32c3.menu.CPUFreq.160=160MHz (WiFi)
wifiduino32c3.menu.CPUFreq.160.build.f_cpu=160000000L
wifiduino32c3.menu.CPUFreq.80=80MHz (WiFi)
wifiduino32c3.menu.CPUFreq.80.build.f_cpu=80000000L
wifiduino32c3.menu.CPUFreq.40=40MHz
wifiduino32c3.menu.CPUFreq.40.build.f_cpu=40000000L
wifiduino32c3.menu.CPUFreq.20=20MHz
wifiduino32c3.menu.CPUFreq.20.build.f_cpu=20000000L
wifiduino32c3.menu.CPUFreq.10=10MHz
wifiduino32c3.menu.CPUFreq.10.build.f_cpu=10000000L

wifiduino32c3.menu.FlashMode.qio=QIO
wifiduino32c3.menu.FlashMode.qio.build.flash_mode=dio
wifiduino32c3.menu.FlashMode.qio.build.boot=qio
wifiduino32c3.menu.FlashMode.dio=DIO
wifiduino32c3.menu.FlashMode.dio.build.flash_mode=dio
wifiduino32c3.menu.FlashMode.dio.build.boot=dio
wifiduino32c3.menu.FlashMode.qout=QOUT
wifiduino32c3.menu.FlashMode.qout.build.flash_mode=dout
wifiduino32c3.menu.FlashMode.qout.build.boot=qout
wifiduino32c3.menu.FlashMode.dout=DOUT
wifiduino32c3.menu.FlashMode.dout.build.flash_mode=dout
wifiduino32c3.menu.FlashMode.dout.build.boot=dout

wifiduino32c3.menu.FlashFreq.80=80MHz
wifiduino32c3.menu.FlashFreq.80.build.flash_freq=80m
wifiduino32c3.menu.FlashFreq.40=40MHz
wifiduino32c3.menu.FlashFreq.40.build.flash_freq=40m

wifiduino32c3.menu.FlashSize.4M=4MB (32Mb)
wifiduino32c3.menu.FlashSize.4M.build.flash_size=4MB
wifiduino32c3.menu.FlashSize.8M=8MB (64Mb)
wifiduino32c3.menu.FlashSize.8M.build.flash_size=8MB
wifiduino32c3.menu.FlashSize.8M.build.partitions=default_8MB
wifiduino32c3.menu.FlashSize.2M=2MB (16Mb)
wifiduino32c3.menu.FlashSize.2M.build.flash_size=2MB
wifiduino32c3.menu.FlashSize.2M.build.partitions=minimal
wifiduino32c3.menu.FlashSize.16M=16MB (128Mb)
wifiduino32c3.menu.FlashSize.16M.build.flash_size=16MB

wifiduino32c3.menu.UploadSpeed.921600=921600
wifiduino32c3.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32c3.menu.UploadSpeed.115200=115200
wifiduino32c3.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32c3.menu.UploadSpeed.256000.windows=256000
wifiduino32c3.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32c3.menu.UploadSpeed.230400=230400
wifiduino32c3.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32c3.menu.UploadSpeed.460800.linux=460800
wifiduino32c3.menu.UploadSpeed.460800.macosx=460800
wifiduino32c3.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32c3.menu.UploadSpeed.512000.windows=512000
wifiduino32c3.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32c3.menu.DebugLevel.none=None
wifiduino32c3.menu.DebugLevel.none.build.code_debug=0
wifiduino32c3.menu.DebugLevel.error=Error
wifiduino32c3.menu.DebugLevel.error.build.code_debug=1
wifiduino32c3.menu.DebugLevel.warn=Warn
wifiduino32c3.menu.DebugLevel.warn.build.code_debug=2
wifiduino32c3.menu.DebugLevel.info=Info
wifiduino32c3.menu.DebugLevel.info.build.code_debug=3
wifiduino32c3.menu.DebugLevel.debug=Debug
wifiduino32c3.menu.DebugLevel.debug.build.code_debug=4
wifiduino32c3.menu.DebugLevel.verbose=Verbose
wifiduino32c3.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32c3.menu.EraseFlash.none=Disabled
wifiduino32c3.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32c3.menu.EraseFlash.all=Enabled
wifiduino32c3.menu.EraseFlash.all.upload.erase_cmd=-e

