xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

wifiduino32s3.name=WiFiduino32S3
wifiduino32s3.vid.0=0x303a
wifiduino32s3.pid.0=0x1001

wifiduino32s3.bootloader.tool=esptool_py
wifiduino32s3.bootloader.tool.default=esptool_py

wifiduino32s3.upload.tool=esptool_py
wifiduino32s3.upload.tool.default=esptool_py
wifiduino32s3.upload.tool.network=esp_ota

wifiduino32s3.upload.maximum_size=1310720
wifiduino32s3.upload.maximum_data_size=327680
wifiduino32s3.upload.flags=
wifiduino32s3.upload.extra_flags=
wifiduino32s3.upload.use_1200bps_touch=false
wifiduino32s3.upload.wait_for_upload_port=false

wifiduino32s3.serial.disableDTR=false
wifiduino32s3.serial.disableRTS=false

wifiduino32s3.build.tarch=xtensa
wifiduino32s3.build.bootloader_addr=0x0
wifiduino32s3.build.target=esp32s3
wifiduino32s3.build.mcu=esp32s3
wifiduino32s3.build.core=esp32
wifiduino32s3.build.variant=wifiduino32s3
wifiduino32s3.build.board=WiFiduino32S3

wifiduino32s3.build.usb_mode=1
wifiduino32s3.build.cdc_on_boot=0
wifiduino32s3.build.msc_on_boot=0
wifiduino32s3.build.dfu_on_boot=0
wifiduino32s3.build.f_cpu=240000000L
wifiduino32s3.build.flash_size=4MB
wifiduino32s3.build.flash_freq=80m
wifiduino32s3.build.flash_mode=dio
wifiduino32s3.build.boot=qio
wifiduino32s3.build.boot_freq=80m
wifiduino32s3.build.partitions=default
wifiduino32s3.build.defines=
wifiduino32s3.build.loop_core=
wifiduino32s3.build.event_core=
wifiduino32s3.build.psram_type=qspi
wifiduino32s3.build.memory_type={build.boot}_{build.psram_type}

wifiduino32s3.menu.PSRAM.disabled=Disabled
wifiduino32s3.menu.PSRAM.disabled.build.defines=
wifiduino32s3.menu.PSRAM.disabled.build.psram_type=qspi
wifiduino32s3.menu.PSRAM.enabled=QSPI PSRAM
wifiduino32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
wifiduino32s3.menu.PSRAM.enabled.build.psram_type=qspi
wifiduino32s3.menu.PSRAM.opi=OPI PSRAM
wifiduino32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
wifiduino32s3.menu.PSRAM.opi.build.psram_type=opi

wifiduino32s3.menu.FlashMode.qio=QIO 80MHz
wifiduino32s3.menu.FlashMode.qio.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.qio.build.boot=qio
wifiduino32s3.menu.FlashMode.qio.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.qio.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.qio120=QIO 120MHz
wifiduino32s3.menu.FlashMode.qio120.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.qio120.build.boot=qio
wifiduino32s3.menu.FlashMode.qio120.build.boot_freq=120m
wifiduino32s3.menu.FlashMode.qio120.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.dio=DIO 80MHz
wifiduino32s3.menu.FlashMode.dio.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.dio.build.boot=dio
wifiduino32s3.menu.FlashMode.dio.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.dio.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.opi=OPI 80MHz
wifiduino32s3.menu.FlashMode.opi.build.flash_mode=dout
wifiduino32s3.menu.FlashMode.opi.build.boot=opi
wifiduino32s3.menu.FlashMode.opi.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.opi.build.flash_freq=80m

wifiduino32s3.menu.FlashSize.4M=4MB (32Mb)
wifiduino32s3.menu.FlashSize.4M.build.flash_size=4MB
wifiduino32s3.menu.FlashSize.8M=8MB (64Mb)
wifiduino32s3.menu.FlashSize.8M.build.flash_size=8MB
wifiduino32s3.menu.FlashSize.8M.build.partitions=default_8MB
wifiduino32s3.menu.FlashSize.16M=16MB (128Mb)
wifiduino32s3.menu.FlashSize.16M.build.flash_size=16MB
#wifiduino32s3.menu.FlashSize.32M=32MB (256Mb)
#wifiduino32s3.menu.FlashSize.32M.build.flash_size=32MB

wifiduino32s3.menu.LoopCore.1=Core 1
wifiduino32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wifiduino32s3.menu.LoopCore.0=Core 0
wifiduino32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wifiduino32s3.menu.EventsCore.1=Core 1
wifiduino32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wifiduino32s3.menu.EventsCore.0=Core 0
wifiduino32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wifiduino32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
wifiduino32s3.menu.USBMode.hwcdc.build.usb_mode=1
wifiduino32s3.menu.USBMode.default=USB-OTG (TinyUSB)
wifiduino32s3.menu.USBMode.default.build.usb_mode=0

wifiduino32s3.menu.CDCOnBoot.default=Disabled
wifiduino32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
wifiduino32s3.menu.CDCOnBoot.cdc=Enabled
wifiduino32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wifiduino32s3.menu.MSCOnBoot.default=Disabled
wifiduino32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
wifiduino32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
wifiduino32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

wifiduino32s3.menu.DFUOnBoot.default=Disabled
wifiduino32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
wifiduino32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
wifiduino32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

wifiduino32s3.menu.UploadMode.default=UART0 / Hardware CDC
wifiduino32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
wifiduino32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
wifiduino32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
wifiduino32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
wifiduino32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

wifiduino32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.default.build.partitions=default
wifiduino32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wifiduino32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wifiduino32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wifiduino32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wifiduino32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wifiduino32s3.menu.PartitionScheme.minimal.build.partitions=minimal
wifiduino32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wifiduino32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wifiduino32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wifiduino32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wifiduino32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wifiduino32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wifiduino32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wifiduino32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
wifiduino32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wifiduino32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wifiduino32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wifiduino32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
wifiduino32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
wifiduino32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wifiduino32s3.menu.PartitionScheme.rainmaker=RainMaker
wifiduino32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wifiduino32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

