xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

esp32-trueverit-iot-driver.name=Trueverit ESP32 Universal IoT Driver

esp32-trueverit-iot-driver.bootloader.tool=esptool_py
esp32-trueverit-iot-driver.bootloader.tool.default=esptool_py

esp32-trueverit-iot-driver.upload.tool=esptool_py
esp32-trueverit-iot-driver.upload.tool.default=esptool_py
esp32-trueverit-iot-driver.upload.tool.network=esp_ota

esp32-trueverit-iot-driver.upload.maximum_size=1310720
esp32-trueverit-iot-driver.upload.maximum_data_size=327680
esp32-trueverit-iot-driver.upload.flags=
esp32-trueverit-iot-driver.upload.extra_flags=

esp32-trueverit-iot-driver.serial.disableDTR=true
esp32-trueverit-iot-driver.serial.disableRTS=true

esp32-trueverit-iot-driver.build.tarch=xtensa
esp32-trueverit-iot-driver.build.bootloader_addr=0x1000
esp32-trueverit-iot-driver.build.target=esp32
esp32-trueverit-iot-driver.build.mcu=esp32
esp32-trueverit-iot-driver.build.core=esp32
esp32-trueverit-iot-driver.build.variant=esp32-trueverit-iot-driver
esp32-trueverit-iot-driver.build.board=Trueverit_ESP32_Universal_IoT_Driver

esp32-trueverit-iot-driver.build.f_cpu=240000000L
esp32-trueverit-iot-driver.build.flash_mode=dio
esp32-trueverit-iot-driver.build.flash_size=4MB
esp32-trueverit-iot-driver.build.boot=dio
esp32-trueverit-iot-driver.build.partitions=default
esp32-trueverit-iot-driver.build.defines=

esp32-trueverit-iot-driver.menu.FlashFreq.80=80MHz
esp32-trueverit-iot-driver.menu.FlashFreq.80.build.flash_freq=80m
esp32-trueverit-iot-driver.menu.FlashFreq.40=40MHz
esp32-trueverit-iot-driver.menu.FlashFreq.40.build.flash_freq=40m

esp32-trueverit-iot-driver.menu.UploadSpeed.115200=115200
esp32-trueverit-iot-driver.menu.UploadSpeed.115200.upload.speed=115200
esp32-trueverit-iot-driver.menu.UploadSpeed.256000.windows=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.256000.upload.speed=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.230400=230400
esp32-trueverit-iot-driver.menu.UploadSpeed.230400.upload.speed=230400
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.linux=460800
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.macosx=460800
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.upload.speed=460800

esp32-trueverit-iot-driver.menu.DebugLevel.none=None
esp32-trueverit-iot-driver.menu.DebugLevel.none.build.code_debug=0
esp32-trueverit-iot-driver.menu.DebugLevel.error=Error
esp32-trueverit-iot-driver.menu.DebugLevel.error.build.code_debug=1
esp32-trueverit-iot-driver.menu.DebugLevel.warn=Warn
esp32-trueverit-iot-driver.menu.DebugLevel.warn.build.code_debug=2
esp32-trueverit-iot-driver.menu.DebugLevel.info=Info
esp32-trueverit-iot-driver.menu.DebugLevel.info.build.code_debug=3
esp32-trueverit-iot-driver.menu.DebugLevel.debug=Debug
esp32-trueverit-iot-driver.menu.DebugLevel.debug.build.code_debug=4
esp32-trueverit-iot-driver.menu.DebugLevel.verbose=Verbose
esp32-trueverit-iot-driver.menu.DebugLevel.verbose.build.code_debug=5

esp32-trueverit-iot-driver.menu.EraseFlash.none=Disabled
esp32-trueverit-iot-driver.menu.EraseFlash.none.upload.erase_cmd=
esp32-trueverit-iot-driver.menu.EraseFlash.all=Enabled
esp32-trueverit-iot-driver.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32-trueverit-iot-driver-mkii.name=Trueverit ESP32 Universal IoT Driver MK II

esp32-trueverit-iot-driver-mkii.bootloader.tool=esptool_py
esp32-trueverit-iot-driver-mkii.bootloader.tool.default=esptool_py

esp32-trueverit-iot-driver-mkii.upload.tool=esptool_py
esp32-trueverit-iot-driver-mkii.upload.tool.default=esptool_py
esp32-trueverit-iot-driver-mkii.upload.tool.network=esp_ota

esp32-trueverit-iot-driver-mkii.upload.maximum_size=1310720
esp32-trueverit-iot-driver-mkii.upload.maximum_data_size=327680
esp32-trueverit-iot-driver-mkii.upload.flags=
esp32-trueverit-iot-driver-mkii.upload.extra_flags=

esp32-trueverit-iot-driver-mkii.serial.disableDTR=true
esp32-trueverit-iot-driver-mkii.serial.disableRTS=true

esp32-trueverit-iot-driver-mkii.build.tarch=xtensa
esp32-trueverit-iot-driver-mkii.build.bootloader_addr=0x1000
esp32-trueverit-iot-driver-mkii.build.target=esp32
esp32-trueverit-iot-driver-mkii.build.mcu=esp32
esp32-trueverit-iot-driver-mkii.build.core=esp32
esp32-trueverit-iot-driver-mkii.build.variant=esp32-trueverit-iot-driver-mkii
esp32-trueverit-iot-driver-mkii.build.board=Trueverit_ESP32_Universal_IoT_Driver_MK_II

esp32-trueverit-iot-driver-mkii.build.f_cpu=240000000L
esp32-trueverit-iot-driver-mkii.build.flash_mode=dio
esp32-trueverit-iot-driver-mkii.build.flash_size=4MB
esp32-trueverit-iot-driver-mkii.build.boot=dio
esp32-trueverit-iot-driver-mkii.build.partitions=default
esp32-trueverit-iot-driver-mkii.build.defines=

esp32-trueverit-iot-driver-mkii.menu.FlashFreq.80=80MHz
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.80.build.flash_freq=80m
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.40=40MHz
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.40.build.flash_freq=40m

esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.115200=115200
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.115200.upload.speed=115200
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.256000.windows=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.256000.upload.speed=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400=230400
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400.upload.speed=230400
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.linux=460800
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.macosx=460800
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.upload.speed=460800

esp32-trueverit-iot-driver-mkii.menu.DebugLevel.none=None
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.none.build.code_debug=0
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.error=Error
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.error.build.code_debug=1
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.warn=Warn
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.warn.build.code_debug=2
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.info=Info
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.info.build.code_debug=3
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.debug=Debug
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.debug.build.code_debug=4
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.verbose=Verbose
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.verbose.build.code_debug=5

