xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
XIAO_ESP32C3.build.tarch=riscv32
XIAO_ESP32C3.build.target=esp
XIAO_ESP32C3.build.mcu=esp32c3
XIAO_ESP32C3.build.core=esp32
XIAO_ESP32C3.build.variant=XIAO_ESP32C3
XIAO_ESP32C3.build.board=XIAO_ESP32C3
XIAO_ESP32C3.build.bootloader_addr=0x0

XIAO_ESP32C3.build.cdc_on_boot=1
XIAO_ESP32C3.build.f_cpu=160000000L
XIAO_ESP32C3.build.flash_size=4MB
XIAO_ESP32C3.build.flash_freq=80m
XIAO_ESP32C3.build.flash_mode=qio
XIAO_ESP32C3.build.boot=qio
XIAO_ESP32C3.build.partitions=default
XIAO_ESP32C3.build.defines=

XIAO_ESP32C3.menu.CDCOnBoot.default=Enabled
XIAO_ESP32C3.menu.CDCOnBoot.default.build.cdc_on_boot=1
XIAO_ESP32C3.menu.CDCOnBoot.cdc=Disabled
XIAO_ESP32C3.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

XIAO_ESP32C3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.default.build.partitions=default
XIAO_ESP32C3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
XIAO_ESP32C3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
XIAO_ESP32C3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
XIAO_ESP32C3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
XIAO_ESP32C3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.minimal.build.partitions=minimal
XIAO_ESP32C3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.no_ota.build.partitions=no_ota
XIAO_ESP32C3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
XIAO_ESP32C3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
XIAO_ESP32C3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
XIAO_ESP32C3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
XIAO_ESP32C3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
XIAO_ESP32C3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
XIAO_ESP32C3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
XIAO_ESP32C3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
XIAO_ESP32C3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
XIAO_ESP32C3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.huge_app.build.partitions=huge_app
XIAO_ESP32C3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
XIAO_ESP32C3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
XIAO_ESP32C3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
XIAO_ESP32C3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
XIAO_ESP32C3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
XIAO_ESP32C3.menu.PartitionScheme.fatflash.build.partitions=ffat
XIAO_ESP32C3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
XIAO_ESP32C3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
XIAO_ESP32C3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
XIAO_ESP32C3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
XIAO_ESP32C3.menu.PartitionScheme.rainmaker=RainMaker
XIAO_ESP32C3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
XIAO_ESP32C3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

XIAO_ESP32C3.menu.CPUFreq.160=160MHz (WiFi)
XIAO_ESP32C3.menu.CPUFreq.160.build.f_cpu=160000000L
XIAO_ESP32C3.menu.CPUFreq.80=80MHz (WiFi)
XIAO_ESP32C3.menu.CPUFreq.80.build.f_cpu=80000000L
XIAO_ESP32C3.menu.CPUFreq.40=40MHz
XIAO_ESP32C3.menu.CPUFreq.40.build.f_cpu=40000000L
XIAO_ESP32C3.menu.CPUFreq.20=20MHz
XIAO_ESP32C3.menu.CPUFreq.20.build.f_cpu=20000000L
XIAO_ESP32C3.menu.CPUFreq.10=10MHz
XIAO_ESP32C3.menu.CPUFreq.10.build.f_cpu=10000000L

XIAO_ESP32C3.menu.FlashMode.qio=QIO
XIAO_ESP32C3.menu.FlashMode.qio.build.flash_mode=dio
XIAO_ESP32C3.menu.FlashMode.qio.build.boot=qio
XIAO_ESP32C3.menu.FlashMode.dio=DIO
XIAO_ESP32C3.menu.FlashMode.dio.build.flash_mode=dio
XIAO_ESP32C3.menu.FlashMode.dio.build.boot=dio
XIAO_ESP32C3.menu.FlashMode.qout=QOUT
XIAO_ESP32C3.menu.FlashMode.qout.build.flash_mode=dout
XIAO_ESP32C3.menu.FlashMode.qout.build.boot=qout
XIAO_ESP32C3.menu.FlashMode.dout=DOUT
XIAO_ESP32C3.menu.FlashMode.dout.build.flash_mode=dout

XIAO_ESP32C3.menu.FlashFreq.80=80MHz
XIAO_ESP32C3.menu.FlashFreq.80.build.flash_freq=80m
XIAO_ESP32C3.menu.FlashFreq.40=40MHz
XIAO_ESP32C3.menu.FlashFreq.40.build.flash_freq=40m

XIAO_ESP32C3.menu.FlashSize.4M=4MB (32Mb)
XIAO_ESP32C3.menu.FlashSize.4M.build.flash_size=4MB
XIAO_ESP32C3.menu.FlashSize.8M=8MB (64Mb)
XIAO_ESP32C3.menu.FlashSize.8M.build.flash_size=8MB
XIAO_ESP32C3.menu.FlashSize.8M.build.partitions=default_8MB
XIAO_ESP32C3.menu.FlashSize.2M=2MB (16Mb)
XIAO_ESP32C3.menu.FlashSize.2M.build.flash_size=2MB
XIAO_ESP32C3.menu.FlashSize.2M.build.partitions=minimal
XIAO_ESP32C3.menu.FlashSize.16M=16MB (128Mb)
XIAO_ESP32C3.menu.FlashSize.16M.build.flash_size=16MB

XIAO_ESP32C3.menu.UploadSpeed.921600=921600
XIAO_ESP32C3.menu.UploadSpeed.921600.upload.speed=921600
XIAO_ESP32C3.menu.UploadSpeed.115200=115200
XIAO_ESP32C3.menu.UploadSpeed.115200.upload.speed=115200
XIAO_ESP32C3.menu.UploadSpeed.256000.windows=256000
XIAO_ESP32C3.menu.UploadSpeed.256000.upload.speed=256000
XIAO_ESP32C3.menu.UploadSpeed.230400.windows.upload.speed=256000
XIAO_ESP32C3.menu.UploadSpeed.230400=230400
XIAO_ESP32C3.menu.UploadSpeed.230400.upload.speed=230400
XIAO_ESP32C3.menu.UploadSpeed.460800.linux=460800
XIAO_ESP32C3.menu.UploadSpeed.460800.macosx=460800
XIAO_ESP32C3.menu.UploadSpeed.460800.upload.speed=460800
XIAO_ESP32C3.menu.UploadSpeed.512000.windows=512000
XIAO_ESP32C3.menu.UploadSpeed.512000.upload.speed=512000

XIAO_ESP32C3.menu.DebugLevel.none=None
XIAO_ESP32C3.menu.DebugLevel.none.build.code_debug=0
XIAO_ESP32C3.menu.DebugLevel.error=Error
XIAO_ESP32C3.menu.DebugLevel.error.build.code_debug=1
XIAO_ESP32C3.menu.DebugLevel.warn=Warn
XIAO_ESP32C3.menu.DebugLevel.warn.build.code_debug=2
XIAO_ESP32C3.menu.DebugLevel.info=Info
XIAO_ESP32C3.menu.DebugLevel.info.build.code_debug=3
XIAO_ESP32C3.menu.DebugLevel.debug=Debug
XIAO_ESP32C3.menu.DebugLevel.debug.build.code_debug=4
XIAO_ESP32C3.menu.DebugLevel.verbose=Verbose
XIAO_ESP32C3.menu.DebugLevel.verbose.build.code_debug=5

XIAO_ESP32C3.menu.EraseFlash.none=Disabled
XIAO_ESP32C3.menu.EraseFlash.none.upload.erase_cmd=
XIAO_ESP32C3.menu.EraseFlash.all=Enabled
XIAO_ESP32C3.menu.EraseFlash.all.upload.erase_cmd=-e

