xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################

connaxio_espoir.name=Connaxio's Espoir
connaxio_espoir.vid.0=0x10C4
connaxio_espoir.pid.0=0x8D9A

connaxio_espoir.bootloader.tool=esptool_py
connaxio_espoir.bootloader.tool.default=esptool_py

connaxio_espoir.upload.tool=esptool_py
connaxio_espoir.upload.tool.default=esptool_py
connaxio_espoir.upload.tool.network=esp_ota

connaxio_espoir.upload.maximum_size=1310720
connaxio_espoir.upload.maximum_data_size=327680
connaxio_espoir.upload.flags=
connaxio_espoir.upload.extra_flags=

connaxio_espoir.serial.disableDTR=true
connaxio_espoir.serial.disableRTS=true

connaxio_espoir.build.tarch=xtensa
connaxio_espoir.build.bootloader_addr=0x1000
connaxio_espoir.build.target=esp32
connaxio_espoir.build.mcu=esp32
connaxio_espoir.build.core=esp32
connaxio_espoir.build.variant=connaxio_espoir
connaxio_espoir.build.board=connaxio_espoir

connaxio_espoir.build.f_cpu=240000000L
connaxio_espoir.build.flash_size=4MB
connaxio_espoir.build.flash_freq=80m
connaxio_espoir.build.flash_mode=dio
connaxio_espoir.build.boot=dio
connaxio_espoir.build.partitions=default
connaxio_espoir.build.defines=
connaxio_espoir.build.loop_core=
connaxio_espoir.build.event_core=

connaxio_espoir.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
connaxio_espoir.menu.PartitionScheme.default.build.partitions=default
connaxio_espoir.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
connaxio_espoir.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
connaxio_espoir.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
connaxio_espoir.menu.PartitionScheme.minimal.build.partitions=minimal
connaxio_espoir.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
connaxio_espoir.menu.PartitionScheme.no_ota.build.partitions=no_ota
connaxio_espoir.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
connaxio_espoir.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
connaxio_espoir.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
connaxio_espoir.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
connaxio_espoir.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
connaxio_espoir.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
connaxio_espoir.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
connaxio_espoir.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
connaxio_espoir.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
connaxio_espoir.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
connaxio_espoir.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
connaxio_espoir.menu.PartitionScheme.huge_app.build.partitions=huge_app
connaxio_espoir.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
connaxio_espoir.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
connaxio_espoir.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
connaxio_espoir.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
connaxio_espoir.menu.PartitionScheme.rainmaker=RainMaker
connaxio_espoir.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
connaxio_espoir.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

connaxio_espoir.menu.CPUFreq.240=240MHz (WiFi/BT)
connaxio_espoir.menu.CPUFreq.240.build.f_cpu=240000000L
connaxio_espoir.menu.CPUFreq.160=160MHz (WiFi/BT)
connaxio_espoir.menu.CPUFreq.160.build.f_cpu=160000000L
connaxio_espoir.menu.CPUFreq.80=80MHz (WiFi/BT)
connaxio_espoir.menu.CPUFreq.80.build.f_cpu=80000000L
connaxio_espoir.menu.CPUFreq.40=40MHz
connaxio_espoir.menu.CPUFreq.40.build.f_cpu=40000000L
connaxio_espoir.menu.CPUFreq.20=20MHz
connaxio_espoir.menu.CPUFreq.20.build.f_cpu=20000000L
connaxio_espoir.menu.CPUFreq.10=10MHz
connaxio_espoir.menu.CPUFreq.10.build.f_cpu=10000000L

connaxio_espoir.menu.FlashFreq.80=80MHz
connaxio_espoir.menu.FlashFreq.80.build.flash_freq=80m
connaxio_espoir.menu.FlashFreq.40=40MHz
connaxio_espoir.menu.FlashFreq.40.build.flash_freq=40m

connaxio_espoir.menu.UploadSpeed.921600=921600
connaxio_espoir.menu.UploadSpeed.921600.upload.speed=921600
connaxio_espoir.menu.UploadSpeed.512000.windows=512000
connaxio_espoir.menu.UploadSpeed.512000.upload.speed=512000
connaxio_espoir.menu.UploadSpeed.460800.linux=460800
connaxio_espoir.menu.UploadSpeed.460800.macosx=460800
connaxio_espoir.menu.UploadSpeed.460800.upload.speed=460800
connaxio_espoir.menu.UploadSpeed.256000.windows=256000
connaxio_espoir.menu.UploadSpeed.256000.upload.speed=256000
connaxio_espoir.menu.UploadSpeed.230400.windows.upload.speed=256000
connaxio_espoir.menu.UploadSpeed.230400=230400
connaxio_espoir.menu.UploadSpeed.230400.upload.speed=230400
connaxio_espoir.menu.UploadSpeed.115200=115200
connaxio_espoir.menu.UploadSpeed.115200.upload.speed=115200

connaxio_espoir.menu.DebugLevel.none=None
connaxio_espoir.menu.DebugLevel.none.build.code_debug=0
connaxio_espoir.menu.DebugLevel.error=Error
connaxio_espoir.menu.DebugLevel.error.build.code_debug=1
connaxio_espoir.menu.DebugLevel.warn=Warn
connaxio_espoir.menu.DebugLevel.warn.build.code_debug=2
connaxio_espoir.menu.DebugLevel.info=Info
connaxio_espoir.menu.DebugLevel.info.build.code_debug=3
connaxio_espoir.menu.DebugLevel.debug=Debug
connaxio_espoir.menu.DebugLevel.debug.build.code_debug=4
connaxio_espoir.menu.DebugLevel.verbose=Verbose
connaxio_espoir.menu.DebugLevel.verbose.build.code_debug=5

connaxio_espoir.menu.EraseFlash.none=Disabled
connaxio_espoir.menu.EraseFlash.none.upload.erase_cmd=
connaxio_espoir.menu.EraseFlash.all=Enabled
connaxio_espoir.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

aw2eth.name=CNRS AW2ETH

aw2eth.bootloader.tool=esptool_py
aw2eth.bootloader.tool.default=esptool_py

aw2eth.upload.tool=esptool_py
aw2eth.upload.tool.default=esptool_py
aw2eth.upload.tool.network=esp_ota

aw2eth.upload.maximum_size=1310720
aw2eth.upload.maximum_data_size=327680
aw2eth.upload.flags=
aw2eth.upload.extra_flags=

aw2eth.serial.disableDTR=true
aw2eth.serial.disableRTS=true

aw2eth.build.tarch=xtensa
aw2eth.build.bootloader_addr=0x1000
aw2eth.build.target=esp32
aw2eth.build.mcu=esp32
aw2eth.build.core=esp32
aw2eth.build.variant=cnrs_aw2eth
aw2eth.build.board=ESP32_PICO

aw2eth.build.f_cpu=240000000L
aw2eth.build.flash_size=4MB
aw2eth.build.flash_freq=80m
aw2eth.build.flash_mode=dio
aw2eth.build.boot=dio
aw2eth.build.partitions=default
aw2eth.build.defines=

