xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
roboheart_hercules.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
roboheart_hercules.menu.PartitionScheme.default.build.partitions=default
roboheart_hercules.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
roboheart_hercules.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
roboheart_hercules.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
roboheart_hercules.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
roboheart_hercules.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
roboheart_hercules.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
roboheart_hercules.menu.PartitionScheme.minimal.build.partitions=minimal
roboheart_hercules.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
roboheart_hercules.menu.PartitionScheme.no_ota.build.partitions=no_ota
roboheart_hercules.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
roboheart_hercules.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
roboheart_hercules.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
roboheart_hercules.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
roboheart_hercules.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
roboheart_hercules.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
roboheart_hercules.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
roboheart_hercules.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
roboheart_hercules.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
roboheart_hercules.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
roboheart_hercules.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
roboheart_hercules.menu.PartitionScheme.huge_app.build.partitions=huge_app
roboheart_hercules.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
roboheart_hercules.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
roboheart_hercules.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
roboheart_hercules.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
roboheart_hercules.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
roboheart_hercules.menu.PartitionScheme.fatflash.build.partitions=ffat
roboheart_hercules.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
roboheart_hercules.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
roboheart_hercules.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
roboheart_hercules.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
roboheart_hercules.menu.PartitionScheme.rainmaker=RainMaker
roboheart_hercules.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
roboheart_hercules.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

roboheart_hercules.menu.CPUFreq.240=240MHz (WiFi/BT)
roboheart_hercules.menu.CPUFreq.240.build.f_cpu=240000000L
roboheart_hercules.menu.CPUFreq.160=160MHz (WiFi/BT)
roboheart_hercules.menu.CPUFreq.160.build.f_cpu=160000000L
roboheart_hercules.menu.CPUFreq.80=80MHz (WiFi/BT)
roboheart_hercules.menu.CPUFreq.80.build.f_cpu=80000000L
roboheart_hercules.menu.CPUFreq.40=40MHz
roboheart_hercules.menu.CPUFreq.40.build.f_cpu=40000000L
roboheart_hercules.menu.CPUFreq.20=20MHz
roboheart_hercules.menu.CPUFreq.20.build.f_cpu=20000000L
roboheart_hercules.menu.CPUFreq.10=10MHz
roboheart_hercules.menu.CPUFreq.10.build.f_cpu=10000000L

roboheart_hercules.menu.FlashMode.qio=QIO
roboheart_hercules.menu.FlashMode.qio.build.flash_mode=dio
roboheart_hercules.menu.FlashMode.qio.build.boot=qio
roboheart_hercules.menu.FlashMode.dio=DIO
roboheart_hercules.menu.FlashMode.dio.build.flash_mode=dio
roboheart_hercules.menu.FlashMode.dio.build.boot=dio
roboheart_hercules.menu.FlashMode.qout=QOUT
roboheart_hercules.menu.FlashMode.qout.build.flash_mode=dout
roboheart_hercules.menu.FlashMode.qout.build.boot=qout
roboheart_hercules.menu.FlashMode.dout=DOUT
roboheart_hercules.menu.FlashMode.dout.build.flash_mode=dout
roboheart_hercules.menu.FlashMode.dout.build.boot=dout

roboheart_hercules.menu.FlashFreq.80=80MHz
roboheart_hercules.menu.FlashFreq.80.build.flash_freq=80m
roboheart_hercules.menu.FlashFreq.40=40MHz
roboheart_hercules.menu.FlashFreq.40.build.flash_freq=40m

roboheart_hercules.menu.UploadSpeed.921600=921600
roboheart_hercules.menu.UploadSpeed.921600.upload.speed=921600
roboheart_hercules.menu.UploadSpeed.115200=115200
roboheart_hercules.menu.UploadSpeed.115200.upload.speed=115200
roboheart_hercules.menu.UploadSpeed.256000.windows=256000
roboheart_hercules.menu.UploadSpeed.256000.upload.speed=256000
roboheart_hercules.menu.UploadSpeed.230400.windows.upload.speed=256000
roboheart_hercules.menu.UploadSpeed.230400=230400
roboheart_hercules.menu.UploadSpeed.230400.upload.speed=230400
roboheart_hercules.menu.UploadSpeed.460800.linux=460800
roboheart_hercules.menu.UploadSpeed.460800.macosx=460800
roboheart_hercules.menu.UploadSpeed.460800.upload.speed=460800
roboheart_hercules.menu.UploadSpeed.512000.windows=512000
roboheart_hercules.menu.UploadSpeed.512000.upload.speed=512000

roboheart_hercules.menu.DebugLevel.none=None
roboheart_hercules.menu.DebugLevel.none.build.code_debug=0
roboheart_hercules.menu.DebugLevel.error=Error
roboheart_hercules.menu.DebugLevel.error.build.code_debug=1
roboheart_hercules.menu.DebugLevel.warn=Warn
roboheart_hercules.menu.DebugLevel.warn.build.code_debug=2
roboheart_hercules.menu.DebugLevel.info=Info
roboheart_hercules.menu.DebugLevel.info.build.code_debug=3
roboheart_hercules.menu.DebugLevel.debug=Debug
roboheart_hercules.menu.DebugLevel.debug.build.code_debug=4
roboheart_hercules.menu.DebugLevel.verbose=Verbose
roboheart_hercules.menu.DebugLevel.verbose.build.code_debug=5

roboheart_hercules.menu.EraseFlash.none=Disabled
roboheart_hercules.menu.EraseFlash.none.upload.erase_cmd=
roboheart_hercules.menu.EraseFlash.all=Enabled
roboheart_hercules.menu.EraseFlash.all.upload.erase_cmd=-e

