xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
##############################################################
VALTRACK_V4_VTS_ESP32_C3.name=VALTRACK_V4_VTS_ESP32_C3
VALTRACK_V4_VTS_ESP32_C3.vid.0=0x303a
VALTRACK_V4_VTS_ESP32_C3.pid.0=0x1001

VALTRACK_V4_VTS_ESP32_C3.bootloader.tool=esptool_py
VALTRACK_V4_VTS_ESP32_C3.bootloader.tool.default=esptool_py

VALTRACK_V4_VTS_ESP32_C3.upload.tool=esptool_py
VALTRACK_V4_VTS_ESP32_C3.upload.tool.default=esptool_py
VALTRACK_V4_VTS_ESP32_C3.upload.tool.network=esp_ota

VALTRACK_V4_VTS_ESP32_C3.upload.maximum_size=1310720
VALTRACK_V4_VTS_ESP32_C3.upload.maximum_data_size=327680
VALTRACK_V4_VTS_ESP32_C3.upload.flags=
VALTRACK_V4_VTS_ESP32_C3.upload.extra_flags=
VALTRACK_V4_VTS_ESP32_C3.upload.use_1200bps_touch=false
VALTRACK_V4_VTS_ESP32_C3.upload.wait_for_upload_port=false

VALTRACK_V4_VTS_ESP32_C3.serial.disableDTR=false
VALTRACK_V4_VTS_ESP32_C3.serial.disableRTS=false

VALTRACK_V4_VTS_ESP32_C3.build.tarch=riscv32
VALTRACK_V4_VTS_ESP32_C3.build.target=esp
VALTRACK_V4_VTS_ESP32_C3.build.mcu=esp32c3
VALTRACK_V4_VTS_ESP32_C3.build.core=esp32
VALTRACK_V4_VTS_ESP32_C3.build.variant=VALTRACK_V4_VTS_ESP32_C3
VALTRACK_V4_VTS_ESP32_C3.build.board=VALTRACK_V4_VTS_ESP32_C3
VALTRACK_V4_VTS_ESP32_C3.build.bootloader_addr=0x0

VALTRACK_V4_VTS_ESP32_C3.build.cdc_on_boot=1
VALTRACK_V4_VTS_ESP32_C3.build.f_cpu=160000000L
VALTRACK_V4_VTS_ESP32_C3.build.flash_size=4MB
VALTRACK_V4_VTS_ESP32_C3.build.flash_freq=80m
VALTRACK_V4_VTS_ESP32_C3.build.flash_mode=qio
VALTRACK_V4_VTS_ESP32_C3.build.boot=qio
VALTRACK_V4_VTS_ESP32_C3.build.partitions=default
VALTRACK_V4_VTS_ESP32_C3.build.defines=

VALTRACK_V4_VTS_ESP32_C3.menu.CDCOnBoot.default=Enabled
VALTRACK_V4_VTS_ESP32_C3.menu.CDCOnBoot.default.build.cdc_on_boot=1
VALTRACK_V4_VTS_ESP32_C3.menu.CDCOnBoot.cdc=Disabled
VALTRACK_V4_VTS_ESP32_C3.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.default.build.partitions=default
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.minimal.build.partitions=minimal
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.no_ota.build.partitions=no_ota
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.huge_app.build.partitions=huge_app
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.fatflash.build.partitions=ffat
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.rainmaker=RainMaker
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
VALTRACK_V4_VTS_ESP32_C3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.160=160MHz (WiFi)
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.160.build.f_cpu=160000000L
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.80=80MHz (WiFi)
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.80.build.f_cpu=80000000L
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.40=40MHz
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.40.build.f_cpu=40000000L
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.20=20MHz
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.20.build.f_cpu=20000000L
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.10=10MHz
VALTRACK_V4_VTS_ESP32_C3.menu.CPUFreq.10.build.f_cpu=10000000L

VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qio=QIO
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qio.build.flash_mode=dio
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qio.build.boot=qio
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.dio=DIO
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.dio.build.flash_mode=dio
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.dio.build.boot=dio
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qout=QOUT
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qout.build.flash_mode=dout
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.qout.build.boot=qout
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.dout=DOUT
VALTRACK_V4_VTS_ESP32_C3.menu.FlashMode.dout.build.flash_mode=dout

VALTRACK_V4_VTS_ESP32_C3.menu.FlashFreq.80=80MHz
VALTRACK_V4_VTS_ESP32_C3.menu.FlashFreq.80.build.flash_freq=80m
VALTRACK_V4_VTS_ESP32_C3.menu.FlashFreq.40=40MHz
VALTRACK_V4_VTS_ESP32_C3.menu.FlashFreq.40.build.flash_freq=40m

VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.4M=4MB (32Mb)
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.4M.build.flash_size=4MB
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.8M=8MB (64Mb)
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.8M.build.flash_size=8MB
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.8M.build.partitions=default_8MB
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.2M=2MB (16Mb)
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.2M.build.flash_size=2MB
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.2M.build.partitions=minimal
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.16M=16MB (128Mb)
VALTRACK_V4_VTS_ESP32_C3.menu.FlashSize.16M.build.flash_size=16MB

