xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
lionbits3.menu.MSCOnBoot.default=Disabled
lionbits3.menu.MSCOnBoot.default.build.msc_on_boot=0
lionbits3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lionbits3.menu.MSCOnBoot.msc.build.msc_on_boot=1

lionbits3.menu.DFUOnBoot.default=Disabled
lionbits3.menu.DFUOnBoot.default.build.dfu_on_boot=0
lionbits3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lionbits3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lionbits3.menu.UploadMode.default=UART0 / Hardware CDC
lionbits3.menu.UploadMode.default.upload.use_1200bps_touch=false
lionbits3.menu.UploadMode.default.upload.wait_for_upload_port=false
lionbits3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lionbits3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lionbits3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lionbits3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lionbits3.menu.PartitionScheme.default.build.partitions=default
lionbits3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lionbits3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lionbits3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
lionbits3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
lionbits3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
lionbits3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
lionbits3.menu.PartitionScheme.minimal.build.partitions=minimal
lionbits3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lionbits3.menu.PartitionScheme.no_ota.build.partitions=no_ota
lionbits3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lionbits3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lionbits3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lionbits3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lionbits3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lionbits3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lionbits3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lionbits3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lionbits3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lionbits3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lionbits3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lionbits3.menu.PartitionScheme.huge_app.build.partitions=huge_app
lionbits3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
lionbits3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
lionbits3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lionbits3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
lionbits3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lionbits3.menu.PartitionScheme.fatflash.build.partitions=ffat
lionbits3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lionbits3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lionbits3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lionbits3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lionbits3.menu.PartitionScheme.rainmaker=RainMaker
lionbits3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lionbits3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lionbits3.menu.CPUFreq.240=240MHz (WiFi)
lionbits3.menu.CPUFreq.240.build.f_cpu=240000000L
lionbits3.menu.CPUFreq.160=160MHz (WiFi)
lionbits3.menu.CPUFreq.160.build.f_cpu=160000000L
lionbits3.menu.CPUFreq.80=80MHz (WiFi)
lionbits3.menu.CPUFreq.80.build.f_cpu=80000000L
lionbits3.menu.CPUFreq.40=40MHz
lionbits3.menu.CPUFreq.40.build.f_cpu=40000000L
lionbits3.menu.CPUFreq.20=20MHz
lionbits3.menu.CPUFreq.20.build.f_cpu=20000000L
lionbits3.menu.CPUFreq.10=10MHz
lionbits3.menu.CPUFreq.10.build.f_cpu=10000000L

lionbits3.menu.UploadSpeed.921600=921600
lionbits3.menu.UploadSpeed.921600.upload.speed=921600
lionbits3.menu.UploadSpeed.115200=115200
lionbits3.menu.UploadSpeed.115200.upload.speed=115200
lionbits3.menu.UploadSpeed.256000.windows=256000
lionbits3.menu.UploadSpeed.256000.upload.speed=256000
lionbits3.menu.UploadSpeed.230400.windows.upload.speed=256000
lionbits3.menu.UploadSpeed.230400=230400
lionbits3.menu.UploadSpeed.230400.upload.speed=230400
lionbits3.menu.UploadSpeed.460800.linux=460800
lionbits3.menu.UploadSpeed.460800.macosx=460800
lionbits3.menu.UploadSpeed.460800.upload.speed=460800
lionbits3.menu.UploadSpeed.512000.windows=512000
lionbits3.menu.UploadSpeed.512000.upload.speed=512000

lionbits3.menu.DebugLevel.none=None
lionbits3.menu.DebugLevel.none.build.code_debug=0
lionbits3.menu.DebugLevel.error=Error
lionbits3.menu.DebugLevel.error.build.code_debug=1
lionbits3.menu.DebugLevel.warn=Warn
lionbits3.menu.DebugLevel.warn.build.code_debug=2
lionbits3.menu.DebugLevel.info=Info
lionbits3.menu.DebugLevel.info.build.code_debug=3
lionbits3.menu.DebugLevel.debug=Debug
lionbits3.menu.DebugLevel.debug.build.code_debug=4
lionbits3.menu.DebugLevel.verbose=Verbose
lionbits3.menu.DebugLevel.verbose.build.code_debug=5

lionbits3.menu.EraseFlash.none=Disabled
lionbits3.menu.EraseFlash.none.upload.erase_cmd=
lionbits3.menu.EraseFlash.all=Enabled
lionbits3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


gen4-ESP32-S3R8n16.name=4D Systems gen4-ESP32 16MB Modules (ESP32-S3R8n16)
gen4-ESP32-S3R8n16.vid.0=0x303a
gen4-ESP32-S3R8n16.pid.0=0x1001

gen4-ESP32-S3R8n16.bootloader.tool=esptool_py
gen4-ESP32-S3R8n16.bootloader.tool.default=esptool_py

gen4-ESP32-S3R8n16.upload.tool=esptool_py
gen4-ESP32-S3R8n16.upload.tool.default=esptool_py
gen4-ESP32-S3R8n16.upload.tool.network=esp_ota

gen4-ESP32-S3R8n16.upload.maximum_size=1310720
gen4-ESP32-S3R8n16.upload.maximum_data_size=327680
gen4-ESP32-S3R8n16.upload.flags=
gen4-ESP32-S3R8n16.upload.extra_flags=
gen4-ESP32-S3R8n16.upload.use_1200bps_touch=false
gen4-ESP32-S3R8n16.upload.wait_for_upload_port=false

gen4-ESP32-S3R8n16.serial.disableDTR=false
gen4-ESP32-S3R8n16.serial.disableRTS=false

gen4-ESP32-S3R8n16.build.tarch=xtensa
gen4-ESP32-S3R8n16.build.bootloader_addr=0x0
gen4-ESP32-S3R8n16.build.target=esp32s3
gen4-ESP32-S3R8n16.build.mcu=esp32s3
gen4-ESP32-S3R8n16.build.core=esp32
gen4-ESP32-S3R8n16.build.variant=esp32_s3r8n16
gen4-ESP32-S3R8n16.build.board=ESP32_S3R8N16

gen4-ESP32-S3R8n16.build.usb_mode=1
gen4-ESP32-S3R8n16.build.cdc_on_boot=1
gen4-ESP32-S3R8n16.build.msc_on_boot=0
gen4-ESP32-S3R8n16.build.dfu_on_boot=0
gen4-ESP32-S3R8n16.build.f_cpu=240000000L
gen4-ESP32-S3R8n16.build.flash_size=16MB (128Mb)
gen4-ESP32-S3R8n16.build.flash_freq=80m
gen4-ESP32-S3R8n16.build.flash_mode=dio
gen4-ESP32-S3R8n16.build.boot=qio
gen4-ESP32-S3R8n16.build.boot_freq=80m
gen4-ESP32-S3R8n16.build.partitions=default
gen4-ESP32-S3R8n16.build.defines=-DBOARD_HAS_PSRAM
gen4-ESP32-S3R8n16.build.loop_core=
gen4-ESP32-S3R8n16.build.event_core=
gen4-ESP32-S3R8n16.build.psram_type=opi
gen4-ESP32-S3R8n16.build.memory_type={build.boot}_{build.psram_type}

gen4-ESP32-S3R8n16.menu.PSRAM.opi=OPI PSRAM
gen4-ESP32-S3R8n16.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
gen4-ESP32-S3R8n16.menu.PSRAM.opi.build.psram_type=opi

gen4-ESP32-S3R8n16.menu.FlashMode.qio=QIO 80MHz
gen4-ESP32-S3R8n16.menu.FlashMode.qio.build.flash_mode=dio
gen4-ESP32-S3R8n16.menu.FlashMode.qio.build.boot=qio
gen4-ESP32-S3R8n16.menu.FlashMode.qio.build.boot_freq=80m
gen4-ESP32-S3R8n16.menu.FlashMode.qio.build.flash_freq=80m

gen4-ESP32-S3R8n16.menu.FlashSize.16M=16MB (128Mb)
gen4-ESP32-S3R8n16.menu.FlashSize.16M.build.flash_size=16MB

gen4-ESP32-S3R8n16.menu.LoopCore.1=Core 1
gen4-ESP32-S3R8n16.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
gen4-ESP32-S3R8n16.menu.LoopCore.0=Core 0
gen4-ESP32-S3R8n16.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

gen4-ESP32-S3R8n16.menu.EventsCore.1=Core 1
gen4-ESP32-S3R8n16.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
gen4-ESP32-S3R8n16.menu.EventsCore.0=Core 0
gen4-ESP32-S3R8n16.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

gen4-ESP32-S3R8n16.menu.USBMode.default=Hardware CDC and JTAG
gen4-ESP32-S3R8n16.menu.USBMode.default.build.usb_mode=1
gen4-ESP32-S3R8n16.menu.USBMode.hwcdc=USB-OTG (TinyUSB)
gen4-ESP32-S3R8n16.menu.USBMode.hwcdc.build.usb_mode=0

gen4-ESP32-S3R8n16.menu.CDCOnBoot.cdc=Enabled
gen4-ESP32-S3R8n16.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
gen4-ESP32-S3R8n16.menu.CDCOnBoot.default=Disabled
gen4-ESP32-S3R8n16.menu.CDCOnBoot.default.build.cdc_on_boot=0

