xiaocainiao11111/ESP32_connect_PS5/esp32-bluepad32-4.1.0/boards.txt
namino_arancio.menu.EraseFlash.none=Disabled
namino_arancio.menu.EraseFlash.none.upload.erase_cmd=
namino_arancio.menu.EraseFlash.all=Enabled
namino_arancio.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

nano_nora.name=Arduino Nano ESP32
nano_nora.vid.0=0x2341
nano_nora.pid.0=0x0070
nano_nora.upload_port.0.vid=0x2341
nano_nora.upload_port.0.pid=0x0070

nano_nora.bootloader.tool=esptool_py
nano_nora.bootloader.tool.default=esptool_py

nano_nora.upload.tool=dfu-util
nano_nora.upload.tool.default=dfu-util
nano_nora.upload.tool.network=esp_ota
nano_nora.upload.protocol=serial
nano_nora.upload.maximum_size=3145728
nano_nora.upload.maximum_data_size=327680
nano_nora.upload.use_1200bps_touch=false
nano_nora.upload.wait_for_upload_port=false

nano_nora.serial.disableDTR=false
nano_nora.serial.disableRTS=false

nano_nora.build.tarch=xtensa
nano_nora.build.bootloader_addr=0x0
nano_nora.build.target=esp32s3
nano_nora.build.mcu=esp32s3
nano_nora.build.core=esp32
nano_nora.build.variant=arduino_nano_nora
nano_nora.build.board=NANO_ESP32
nano_nora.build.code_debug=0

nano_nora.build.usb_mode=0
nano_nora.build.cdc_on_boot=1
nano_nora.build.msc_on_boot=0
nano_nora.build.dfu_on_boot=1
nano_nora.build.f_cpu=240000000L
nano_nora.build.flash_size=16MB
nano_nora.build.flash_freq=80m
nano_nora.build.flash_mode=dio
nano_nora.build.boot=qio
nano_nora.build.boot_freq=80m
nano_nora.build.partitions=app3M_fat9M_fact512k_16MB
nano_nora.build.defines=-DBOARD_HAS_PIN_REMAP {build.disable_pin_remap} -DBOARD_HAS_PSRAM '-DUSB_MANUFACTURER="Arduino"' '-DUSB_PRODUCT="Nano ESP32"'
nano_nora.build.loop_core=-DARDUINO_RUNNING_CORE=1
nano_nora.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nano_nora.build.psram_type=opi
nano_nora.build.memory_type={build.boot}_{build.psram_type}
nano_nora.build.disable_pin_remap=

nano_nora.debug_config.nano_nora.cortex-debug.custom.name=Arduino on Nano ESP32
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideAttachCommands.0=set remote hardware-watchpoint-limit 2
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideAttachCommands.1=monitor reset halt
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideAttachCommands.2=monitor gdb_sync
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideAttachCommands.3=interrupt
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_nora.debug_config.nano_nora.cortex-debug.custom.overrideRestartCommands.2=interrupt
nano_nora.debug.additional_config=debug_config.nano_nora

nano_nora.tools.esptool_py.program.pattern_args=--chip {build.mcu} --port "{serial.port}" --before default_reset --after hard_reset write_flash -z --flash_mode {build.flash_mode} --flash_freq {build.flash_freq} --flash_size {build.flash_size} {build.bootloader_addr} "{build.path}/{build.project_name}.bootloader.bin" 0x8000 "{build.path}/{build.project_name}.partitions.bin" 0xe000 "{runtime.platform.path}/tools/partitions/boot_app0.bin" 0xf70000 "{build.variant.path}/extra/nora_recovery/nora_recovery.ino.bin" 0x10000 "{build.path}/{build.project_name}.bin"
nano_nora.tools.esptool_py.erase.pattern_args=--chip {build.mcu} --port "{serial.port}" --before default_reset --after hard_reset erase_flash

nano_nora.programmer.default=esptool
nano_nora.debug.executable=

nano_nora.menu.PartitionScheme.default=With FAT partition (default)
nano_nora.menu.PartitionScheme.spiffs=With SPIFFS partition (advanced)
nano_nora.menu.PartitionScheme.spiffs.build.partitions=app3M_spiffs9M_fact512k_16MB

nano_nora.menu.PinNumbers.default=By Arduino pin (default)
nano_nora.menu.PinNumbers.byGPIONumber=By GPIO number (legacy)
nano_nora.menu.PinNumbers.byGPIONumber.build.disable_pin_remap=-DBOARD_USES_HW_GPIO_NUMBERS

nano_nora.menu.USBMode.default=Normal mode (TinyUSB)
nano_nora.menu.USBMode.hwcdc=Debug mode (Hardware CDC)
nano_nora.menu.USBMode.hwcdc.build.usb_mode=1
nano_nora.menu.USBMode.hwcdc.debug.executable={build.path}/{build.project_name}.elf

##############################################################

ioxesp32.name=IOXESP32

ioxesp32.bootloader.tool=esptool_py
ioxesp32.bootloader.tool.default=esptool_py

ioxesp32.upload.tool=esptool_py
ioxesp32.upload.tool.default=esptool_py
ioxesp32.upload.tool.network=esp_ota

ioxesp32.upload.maximum_size=1310720
ioxesp32.upload.maximum_data_size=327680
ioxesp32.upload.flags=
ioxesp32.upload.extra_flags=

ioxesp32.serial.disableDTR=true
ioxesp32.serial.disableRTS=true

ioxesp32.build.tarch=xtensa
ioxesp32.build.bootloader_addr=0x1000
ioxesp32.build.target=esp32
ioxesp32.build.mcu=esp32
ioxesp32.build.core=esp32
ioxesp32.build.variant=ioxesp32
ioxesp32.build.board=IOXESP32

ioxesp32.build.f_cpu=240000000L
ioxesp32.build.flash_mode=dio
ioxesp32.build.flash_size=4MB
ioxesp32ps.build.flash_freq=40m
ioxesp32.build.boot=dio
ioxesp32.build.partitions=default
ioxesp32.build.defines=
ioxesp32.build.extra_libs=

ioxesp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ioxesp32.menu.PartitionScheme.default.build.partitions=default
ioxesp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ioxesp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ioxesp32.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
ioxesp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
ioxesp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
ioxesp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ioxesp32.menu.PartitionScheme.minimal.build.partitions=minimal
ioxesp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ioxesp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
ioxesp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ioxesp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ioxesp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ioxesp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ioxesp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ioxesp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ioxesp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ioxesp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ioxesp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ioxesp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
ioxesp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ioxesp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ioxesp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ioxesp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ioxesp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
ioxesp32.menu.PartitionScheme.fatflash.build.partitions=ffat
ioxesp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.rainmaker=RainMaker
ioxesp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ioxesp32.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

ioxesp32.menu.FlashFreq.80=80MHz
ioxesp32.menu.FlashFreq.80.build.flash_freq=80m
ioxesp32.menu.FlashFreq.40=40MHz
ioxesp32.menu.FlashFreq.40.build.flash_freq=40m

ioxesp32.menu.UploadSpeed.921600=921600
ioxesp32.menu.UploadSpeed.921600.upload.speed=921600
ioxesp32.menu.UploadSpeed.115200=115200
ioxesp32.menu.UploadSpeed.115200.upload.speed=115200
ioxesp32.menu.UploadSpeed.256000.windows=256000
ioxesp32.menu.UploadSpeed.256000.upload.speed=256000
ioxesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
ioxesp32.menu.UploadSpeed.230400=230400
ioxesp32.menu.UploadSpeed.230400.upload.speed=230400
ioxesp32.menu.UploadSpeed.460800.linux=460800
ioxesp32.menu.UploadSpeed.460800.macosx=460800
ioxesp32.menu.UploadSpeed.460800.upload.speed=460800
ioxesp32.menu.UploadSpeed.512000.windows=512000
ioxesp32.menu.UploadSpeed.512000.upload.speed=512000

ioxesp32.menu.DebugLevel.none=None
ioxesp32.menu.DebugLevel.none.build.code_debug=0
ioxesp32.menu.DebugLevel.error=Error
ioxesp32.menu.DebugLevel.error.build.code_debug=1
ioxesp32.menu.DebugLevel.warn=Warn
ioxesp32.menu.DebugLevel.warn.build.code_debug=2
ioxesp32.menu.DebugLevel.info=Info
ioxesp32.menu.DebugLevel.info.build.code_debug=3
ioxesp32.menu.DebugLevel.debug=Debug
ioxesp32.menu.DebugLevel.debug.build.code_debug=4
ioxesp32.menu.DebugLevel.verbose=Verbose
ioxesp32.menu.DebugLevel.verbose.build.code_debug=5

